{
    "body": [
        {
            "title": "Two weeks with Apple Fitness+",
            "description": "I’m at the stage of my pandemic fitness routine where if I finish a workout without having yelled in frustration, I have to wonder if the session was too easy. Whether it’s because I’ve grown bored or I’m getting stronger, I’ve struggled to find exercise vide…",
            "content": "That’s something you won’t find on services from Fitbit and Samsung, which also offer workout content alongside their wearables. Similar to Fitness +, Fitbit Premium costs $10 a month and includes a … [+3957 chars]"
        },
        {
            "title": "How to Set Up Google Stadia on iOS if There's No 'App'",
            "description": "As you recall, Apple runs its App Store with an iron fist. And it’ll be a cold day in Cupertino before the company allows game-streaming services to have regular ol’ apps—not unless the service submits each streamable game for review by Apple, which isn’t goi…",
            "content": "As you recall, Apple runs its App Store with an iron fist. And itll be a cold day in Cupertino before the company allows game-streaming services to have regular ol appsnot unless the service submits … [+3082 chars]"
        },
        {
            "title": "Up Your Selfie Video Game With This Apple Watch Hack",
            "description": "For those who haven’t yet splurged on a fancier setup for recording videos at home, know that your smartphone’s camera (ideally coupled with a better microphone that you clip to your body) is good enough in most cases—the rear-facing camera(s), that is. The f…",
            "content": "For those who havent yet splurged on a fancier setup for recording videos at home, know that your smartphones camera (ideally coupled with a better microphone that you clip to your body) is good enou… [+1889 chars]"
        },
        {
            "title": "Daily Crunch: Apple launches Fitness+",
            "description": "We review Apple Fitness+, Gmail goes down and Pornhub cracks down on unverified content. This is your Daily Crunch for December 14, 2020. The big story: Apple launches Fitness+ Brian Heater tried out Apple’s new $10-per-month subscription service for guided w…",
            "content": "We review Apple Fitness+, Gmail goes down and Pornhub cracks down on unverified content. This is your Daily Crunch for December 14, 2020.\r\nThe big story: Apple launches Fitness+\r\nBrian Heater tried o… [+2872 chars]"
        },
        {
            "title": "Apple is removing Parler from the App Store",
            "description": "Apple has removed Parler from the App Store. Apple follows Google in removing the app, which is known for being conservative-friendly and having less stringent moderation than other social media platforms.",
            "content": "Google removed the app from the Play Store Friday evening\r\nIllustration by Alex Castro / The Verge\r\nApple is removing Parler from the App Store, following accusations that the social media app was fo… [+3575 chars]"
        },
        {
            "title": "The Best Apple-ish Gear for Apple Haters",
            "description": "Apple products weren’t exactly allowed in my house growing up. My school had a lab filled with Apple computers, so I got exposed to the basic ins and outs of macOS. But inside my home it was Microsoft-Microsoft-Microsoft. My dad was a computer hardware engine…",
            "content": "Apple products werent exactly allowed in my house growing up. My school had a lab filled with Apple computers, so I got exposed to the basic ins and outs of macOS. But inside my home it was Microsoft… [+4421 chars]"
        },
        {
            "title": "Hyundai and Apple are talking about Apple Car production",
            "description": "The Apple Car is turning from a myth to a potential product. \nFollowing the recent report that Apple is looking into building a car and launching it by 2024, Korean automaker Hyundai has confirmed to CNBC that Apple has discussed the product with \"a variety o…",
            "content": "The Apple Car is turning from a myth to a potential product. \r\nFollowing the recent report that Apple is looking into building a car and launching it by 2024, Korean automaker Hyundai has confirmed t… [+1522 chars]"
        },
        {
            "title": "Apple suspend Parler from App Store",
            "description": "Following reports of a warning to site developers sent earlier this Apple today confirmed that it has pulled right wing social media platform Parler from the App Store. Apple tells TechCrunch, We have always supported diverse points of view being represented …",
            "content": "Following reports of a warning to site developers sent earlier this Apple today confirmed that it has pulled right wing social media platform Parler from the App Store.\r\nApple tells TechCrunch,\r\nWe h… [+3743 chars]"
        },
        {
            "title": "Hyundai confirms discussions about building a car with Apple",
            "description": "Last month Reuters reported that Apple’s Project Titan self-driving electric car effort could produce a vehicle by 2024 or so, and now there are more rumors suggesting the company is serious about getting into the business. Earlier today a Bloomberg report fo…",
            "content": "Last month Reutersreported that Apple’s Project Titan self-driving electric car effort could produce a vehicle by 2024 or so, and now there are more rumors suggesting the company is serious about get… [+599 chars]"
        },
        {
            "title": "Ward Off Security Risks With Apple's New Security and Privacy Guide",
            "description": "We try to cover just about everything you can do with your iPhone, but even if you feel like you’ve mastered Apple’s smartphone, there’s always something new you can learn. To help stay vigilant about the people (and companies) that can access your device, da…",
            "content": "We try to cover just about everything you can do with your iPhone, but even if you feel like youve mastered Apples smartphone, theres always something new you can learn. To help stay vigilant about t… [+6002 chars]"
        },
        {
            "title": "Apple Arcade hit 'Grindstone' makes its way to Switch today",
            "description": "Grindstone, the stellar Apple Arcade puzzler from Sword and Sworcery studio Capybara Games, is available on the Nintendo Switch right now. It’s a timed exclusive on the new platform, which means it’ll likely hit additional consoles after a predetermined amoun…",
            "content": "Grindstone, the stellar Apple Arcade puzzler from Sword and Sworcery studio Capybara Games, is available on the Nintendo Switch right now. It’s a timed exclusive on the new platform, which means it’l… [+768 chars]"
        },
        {
            "title": "Apple promises to fix ultrawide monitor support on M1 Macs",
            "description": "Life isn’t pleasant right now if you want to pair an M1 Mac with an ultrawide monitor, but help is on the way. Macworld and 9to5Mac have learned that Apple is promising a macOS update to fix a lack of supported resolutions on ultrawide and super-ultrawide mon…",
            "content": "Life isn’t pleasant right now if you want to pair an M1 Mac with an ultrawide monitor, but help is on the way. Macworld and 9to5Mac have learned that Apple is promising a macOS update to fix a lack o… [+439 chars]"
        },
        {
            "title": "Apple, Amazon and Tesla supplier accused of using forced labor",
            "description": "According to an investigation by The Washington Post and the Tech Transparency Project, companies including Apple, Amazon and Tesla are sourcing parts from a Chinese supplier that allegedly uses forced Muslim labor. The Tech Transparency Project found documen…",
            "content": "An Apple spokesperson told the publication that the company confirmed Lens Technology “has not received any labor transfers of Uyghur workers from Xinjiang.” The company’s supplier progress report st… [+3132 chars]"
        },
        {
            "title": "How to make the most of your new Apple Watch",
            "description": "So you’ve been given or bought yourself an Apple Watch for the holidays. Congrats! Whether you’re a first-time smartwatch user or just new to watchOS, wearing an Apple Watch can feel like a big change in your daily life. You don’t want to just strap it on and…",
            "content": "During the setup, you’ll be asked to turn on things like SOS and automatic watchOS updates, and it’s a good idea to enable both. SOS allows you to quickly make a call to local emergency responders by… [+4363 chars]"
        },
        {
            "title": "Apple Watch prototype exposes the company's 'Ultra' security testing program",
            "description": "A video leak appears to show a Watch prototype and reveals how Apple gets such devices to developers while still keeping them under a veil of “ultra” security. Released by a leak site called Apple Demo and first discovered via The Verge, it shows a Watch deve…",
            "content": "The device is a good deal larger than a Watch and has a home button but no crown. Once turned on, it shows the Watch apps, including Apple’s internal testing software. One of those, the Lisa tester (… [+473 chars]"
        },
        {
            "title": "Apple says a record $540 million was spent on apps this New Year's Day",
            "description": "If you thought Apple device owners would splurge on apps during a holiday season when they were stuck at home... you guessed correctly. Apple has revealed that the App Store broke a single-day spending record on New Year’s Day, with people spending over $540 …",
            "content": "If you thought Apple device owners would splurge on apps during a holiday season when they were stuck at home... you guessed correctly. Apple has revealed that the App Store broke a single-day spendi… [+441 chars]"
        },
        {
            "title": "Where's the Apple TV Dongle?",
            "description": "A new Apple TV could be arriving in 2021, but how will it compete with so many powerful streaming devices when it retails for three times the cost?Read more...",
            "content": "A new Apple TV could be arriving in 2021, but how will it compete with so many powerful streaming devices when it retails for three times the cost?\r\nThis year saw the release of several streaming sti… [+2990 chars]"
        },
        {
            "title": "Get 3 months of Apple Fitness+ for free when you buy an Apple Watch",
            "description": "SAVE OVER £20: Get three months of Apple Fitness+ for free when you buy an eligible new Apple Watch.  \n\nIt's at this early stage of the year that everyone seems to be getting fit, or at least trying to actually move from the sofa. If you're one of these dedic…",
            "content": "SAVE OVER £20: Get three months of Apple Fitness+ for free when you buy an eligible new Apple Watch.  \r\nIt's at this early stage of the year that everyone seems to be getting fit, or at least trying … [+1320 chars]"
        },
        {
            "title": "Elon Musk says he tried to sell Tesla to Apple and Tim Cook snubbed him",
            "description": "Elon Musk apparently once tried to sell Tesla to Apple. Replying to a tweet about yesterday’s Reuters report on the Apple’s electric car ambitions, Musk said, “During the darkest days of the Model 3 program, I reached out to Tim Cook to discuss the possibilit…",
            "content": "“Strange, if true,” Musk said of those suggestions. He went on to add Tesla already uses iron-phosphate batteries in vehicles it produces at its Shanghai Gigafactory, and said a monocell design is “e… [+597 chars]"
        },
        {
            "title": "Apple Fitness+ Is Either Right on Time or Much Too Late",
            "description": "Apple invites users to sweat along with prerecorded classes on its new streaming workout platform—but the experience lags behind the competition.",
            "content": "Welcome to Apple World. Thats what launching an Apple Fitness+ workout is like, stepping into a world of wood-paneled walls, charming accents, and Apple Watches. You can almost smell the eucalyptus t… [+3702 chars]"
        }
    ]
}