{
    "body": [
        {
            "title": "Facebook bans Trump ‘indefinitely’",
            "description": "In the wake of an unprecedented mob attack at the US Capitol, Facebook has banned Trump from its platform (including Instagram) indefinitely, citing his use of the platform to subvert American democracy.",
            "content": "The risks of allowing the President to continue to use our service... are simply too great\r\nIllustration by Alex Castro / The Verge\r\nIn a blog post Thursday, Facebook CEO Mark Zuckerberg announced th… [+696 chars]"
        },
        {
            "title": "Kids Can Chat With Santa on Facebook Messenger",
            "description": "It used to be that a child’s only options for personally connecting with Santa in the lead-up to Christmas were to send a handwritten letter to the North Pole or snag a few one-on-one moments at their local mall. But in 2020, even in the middle of a pandemic,…",
            "content": "It used to be that a childs only options for personally connecting with Santa in the lead-up to Christmas were to send a handwritten letter to the North Pole or snag a few one-on-one moments at their… [+1536 chars]"
        },
        {
            "title": "FTC demands Amazon, Facebook and others explain their privacy practices",
            "description": "The Federal Trade Commission has ordered nine social media and video streaming companies to provide details about their privacy practices, including how they collect and use personal information. It has also asked Amazon, TikTok owner ByteDance, Discord, Face…",
            "content": "The FTC is demanding information on “how social media and video streaming services collect, use, track, estimate, or derive personal and demographic information; how they determine which ads and othe… [+1375 chars]"
        },
        {
            "title": "Facebook adds new notifications for COVID-19 misinformation",
            "description": "Facebook is doing more to alert users who have shared dangerous misinformation about the coronavirus pandemic. The social network is introducing a new notification that will tell users that a post they liked, shared or commented on has been removed due to “po…",
            "content": "With the latest update, Facebook is now acknowledging those messages didn’t go far enough. The new notifications will be much more detailed. “Clicking on the notification will take users to a landing… [+1411 chars]"
        },
        {
            "title": "Facebook is winding down some of its Irish tax havens",
            "description": "Facebook is closing some of the companies that were key to its Irish tax havens. The Sunday Times and The Guardian report that Facebook is winding down three Ireland holding companies and moving their intellectual property to the US, increasing the company’s …",
            "content": "The social media giant, like other tech companies, has caught flak for using arrangements in Ireland to avoid paying taxes in other countries. The IRS sued Facebook in 2016 to learn more about its pr… [+634 chars]"
        },
        {
            "title": "Sorry, Facebook. iOS Changes Aren't Bad for Small Businesses",
            "description": "The social media giant would have you believe that Apple’s privacy update will hurt the little guys. But Facebook’s motives aren’t so altruistic.",
            "content": "Its true that small businesses generally depend on advertising. In recent years, because of the overwhelming popularity of social media, and Facebooks monopoly in that space, thats meant that many sm… [+4053 chars]"
        },
        {
            "title": "Should Facebook Be Broken Up?",
            "description": "The U.S. government and more than 40 states say the social networking company has become an unlawful monopoly that is hurting consumers.",
            "content": "<ul><li>Regulators have accused Facebook of buying up rising rivals to cement its dominance over social media.\r\n</li><li>The cases against Facebook are far from a slam dunk the standards of proof are… [+1203 chars]"
        },
        {
            "title": "Facebook reportedly hesitated to remove Indian extremists over risk to staff",
            "description": "Facebook is typically quick to ban groups advocating for real-world violence, but it may have been reluctant earlier this year. Wall Street Journal sources claimed Facebook wanted to ban the Indian nationalist group Bajrang Dal as a “dangerous organization,” …",
            "content": "Spokesman Andy Stone said Facebook applied its dangerous group level “without regard to political position or party affiliation,” and that the discussion of threats to staff was “part of the standard… [+730 chars]"
        },
        {
            "title": "Facebook appoints a vice president of civil rights",
            "description": "Facebook has hired a vice president of civil rights as it looks to improve its handling of such issues. Roy Austin Jr., a long-time civil rights attorney and advocate, will set up Facebook's civil rights organization and become a deputy general counsel. Howev…",
            "content": "Facebook’s hiring of Austin comes as the company faces deeper scrutiny over its handling of racism, violent rhetoric and misinformation in the wake of last week’s pro-Trump riots on Capitol Hill. It … [+890 chars]"
        },
        {
            "title": "WhatsApp: Let us share your data with Facebook or else",
            "description": "In a surprise move, WhatsApp recently gave many of its users a difficult choice: they could either accept a revised privacy policy that explicit allowed the service to share information with parent company Facebook by February 8th, or decline and risk not bei…",
            "content": "Upon further inspection, the updated policy makes clear that data collected by WhatsApp — including user phone numbers, “transaction data, service-related information, information on how you interact… [+3050 chars]"
        },
        {
            "title": "Facebook and YouTube remove Trump video calling rioters ‘very special’",
            "description": "Facebook and YouTube both removed a video posted by Donald Trump, in which he addressed the rioters who descended on Washington D.C as Congress convened to certify the results of the November election. In the one-minute clip, the president told his supporters…",
            "content": "Facebook and YouTube both removed a video posted by Donald Trump, in which he addressed the rioters who descended on Washington D.C as Congress convened to certify the results of the November electio… [+568 chars]"
        },
        {
            "title": "Facebook hires a VP of civil rights",
            "description": "Facebook has hired Roy Austin to become its first-ever VP of Civil Rights and Deputy General Counsel to create a new civil rights organization within the company, Facebook announced today. Austin is set to start on January 19 and will be based in Washington, …",
            "content": "Facebook has hired Roy Austin to become its first-ever VP of Civil Rights and Deputy General Counsel to create a new civil rights organization within the company, Facebook announced today. Austin is … [+2320 chars]"
        },
        {
            "title": "What a Facebook Photos product manager thinks about antitrust",
            "description": "We may pick a battle with Facebook and win, but lose the larger war. Losing that war may mean pushing the next Instagram out of Silicon Valley.",
            "content": "Leading up to Facebooks acquisition of Instagram, I was the product manager in charge of Facebook Photos. Mark Zuckerberg had bought my previous company, Divvyshot, one of the first iOS photo-sharing… [+9011 chars]"
        },
        {
            "title": "Facebook Bans Trump Indefinitely",
            "description": "“We believe the risks of allowing the president to continue to use our service during this period are simply too great,” Mark Zuckerberg, Facebook’s chief executive, said.",
            "content": "Facebook will block President Trump on its platforms, including Instagram, at least until the end of his term, chief executive Mark Zuckerberg said in a post on Thursday.\r\nThe shocking events of the … [+533 chars]"
        },
        {
            "title": "Gillmor Gang: Full Stream Ahead",
            "description": "Twitter is shutting down Periscope, the video app it acquired several years ago when Facebook Live threatened to lap the field. When we stream the Gillmor Gang sessions, we send them to Facebook, Twitter, and an unlisted embed on YouTube. At one point, we pla…",
            "content": "Twitter is shutting down Periscope, the video app it acquired several years ago when Facebook Live threatened to lap the field. When we stream the Gillmor Gang sessions, we send them to Facebook, Twi… [+5206 chars]"
        },
        {
            "title": "Facebook and YouTube remove Trump video calling extremists ‘special’",
            "description": "Facebook and YouTube have removed a video posted by President Trump telling rioters who stormed Congress “we love you.” The same video was left online but blocked from being shared by Twitter just minutes ago. A great deal of video and content from the chaoti…",
            "content": "Facebook and YouTube have removed a video posted by President Trump telling rioters who stormed Congress “we love you.” The same video was left online but blocked from being shared by Twitter just mi… [+1946 chars]"
        },
        {
            "title": "Daily Crunch: Facebook bans Trump for two weeks",
            "description": "Online platforms take action against President Trump, Lenovo tries out a swiveling screen and Roblox raises $250 million. This is your Daily Crunch for January 7, 2021. The big story: Facebook bans Trump for two weeks After a pro-Trump mob stormed the U.S. Ca…",
            "content": "Online platforms take action against President Trump, Lenovo tries out a swiveling screen and Roblox raises $250 million. This is your Daily Crunch for January 7, 2021.\r\nThe big story: Facebook bans … [+3111 chars]"
        },
        {
            "title": "WhatsApp set an all-time record for calls on New Year's Eve",
            "description": "The COVID-19 pandemic forced many to have virtual New Year’s Eve get-togethers, and that’s very clearly reflected in WhatsApp’s numbers. Facebook’s chat app set a record as 2020 came to a close, with 1.4 billion video and voice calls placed on New Year’s Eve …",
            "content": "The COVID-19 pandemic forced many to have virtual New Year’s Eve get-togethers, and that’s very clearly reflected in WhatsApp’s numbers. Facebook’s chat app set a record as 2020 came to a close, with… [+478 chars]"
        },
        {
            "title": "Your Facebook, Instagram, and LinkedIn Data Might Have Leaked Last Month",
            "description": "I hate saying that “this is kind of the norm” when talking about a data breach, but here we go again. A social-media management company called Socialarks recently suffered a data leak to the tune of more than 408GB of personal data for around 214 million Face…",
            "content": "I hate saying that this is kind of the norm when talking about a data breach, but here we go again. A social-media management company called Socialarks recently suffered a data leak to the tune of mo… [+3744 chars]"
        },
        {
            "title": "Rest In Peace, Facebook Ads Boycott (2020—2020)",
            "description": "This past summer, dozens of major brands pulled their ad dollars from Facebook in a protest of the company’s handling of the hate speech and disinformation. Apparently the company has done enough to win back one of its biggest fish: Unilever, which announced …",
            "content": "This past summer, dozens of major brands pulled their ad dollars from Facebook in a protest of the companys handling of the hate speech and disinformation. Apparently the company has done enough to w… [+3774 chars]"
        }
    ]
}