{
    "body": [
        {
            "title": "Grab a Kyvol Cybovac E20 Robot Vacuum for Just $149",
            "description": "Kyvol Cybovac E20 Robot Vacuum | $149 | Amazon | Clip couponRead more...",
            "content": "Kyvol Cybovac E20 Robot Vacuum | $149 | Amazon | Clip coupon\r\nIf you could use an extra hand around the home right about now, a robot vacuum cleaner can help ease the torturous routine of keeping thi… [+477 chars]"
        },
        {
            "title": "Amazon is cutting off Parler's servers",
            "description": "Amazon has told Parler it will suspend the company’s AWS hosting services access, according to BuzzFeed News. The news comes on the same day that Apple suspended the social media app, which supporters of President Donald Trump and far-right extremists used to…",
            "content": "Amazon has told Parler it will suspend the company’s AWS hosting services access, according to BuzzFeed News. The news comes on the same day that Apple suspended the social media app, which supporter… [+548 chars]"
        },
        {
            "title": "Amazon has purchased podcast network Wondery",
            "description": "As expected, Amazon has acquired one of the few remaining large and independent podcast networks in the US. On Wednesday, the retailer announced that Wondery, best known for producing shows like Blood Ties and Dying for Sex, will join Amazon Music as part of …",
            "content": "“Amazon Music launched podcasts in September 2020, and together with Wondery, we hope to accelerate the growth and evolution of podcasts by bringing creators, hosts and immersive experiences to even … [+525 chars]"
        },
        {
            "title": "Daily Crunch: Amazon acquires Wondery",
            "description": "Amazon makes a big podcast acquisition, a Chinese robot maker raises $100 million and we review a robotic cat pillow. This is your Daily Crunch for December 30, 2020. The big story: Amazon acquires Wondery Amazon is the latest company to make a big acquisitio…",
            "content": "Amazon makes a big podcast acquisition, a Chinese robot maker raises $100 million and we review a robotic cat pillow. This is your Daily Crunch for December 30, 2020.\r\nThe big story: Amazon acquires … [+2257 chars]"
        },
        {
            "title": "How to Stream Amazon Luna Games on Android",
            "description": "Amazon’s Luna cloud gaming service is now available for Android in the U.S., adding yet another option for playing console-quality games from anywhere on your smartphone. Using Luna on Android is simple, but there are several requirements you’ll have to addre…",
            "content": "Amazons Luna cloud gaming service is now available for Android in the U.S., adding yet another option for playing console-quality games from anywhere on your smartphone. Using Luna on Android is simp… [+1941 chars]"
        },
        {
            "title": "Amazon brings group calls to Echo devices in the US",
            "description": "As promised, Amazon is adding group calling to Echo devices — just in time for those socially distant holiday get-togethers. If you live in the US, you can use Alexa to start a group call on our Echo speaker or display. So long as one person in your circle ha…",
            "content": "As promised, Amazon is adding group calling to Echo devices — just in time for those socially distant holiday get-togethers. If you live in the US, you can use Alexa to start a group call on our Echo… [+603 chars]"
        },
        {
            "title": "FTC demands Amazon, Facebook and others explain their privacy practices",
            "description": "The Federal Trade Commission has ordered nine social media and video streaming companies to provide details about their privacy practices, including how they collect and use personal information. It has also asked Amazon, TikTok owner ByteDance, Discord, Face…",
            "content": "The FTC is demanding information on “how social media and video streaming services collect, use, track, estimate, or derive personal and demographic information; how they determine which ads and othe… [+1375 chars]"
        },
        {
            "title": "Jabra's Elite 85t wireless earbuds drop to $170 at Amazon",
            "description": "Don’t worry if you missed out on a pair of wireless earbuds this holiday season, especially if you want an alternative to some of the usual options. Amazon is selling Jabra’s Elite 85t earbuds for $170, or $60 below the usual price, after a coupon automatical…",
            "content": "Jabra’s earbuds are part of a fiercely competitive space, but they do stand out in a few noteworthy areas. We enjoyed the strong noise cancellation and sound customization. The Elite 85t might also b… [+921 chars]"
        },
        {
            "title": "Apple, Amazon and Tesla supplier accused of using forced labor",
            "description": "According to an investigation by The Washington Post and the Tech Transparency Project, companies including Apple, Amazon and Tesla are sourcing parts from a Chinese supplier that allegedly uses forced Muslim labor. The Tech Transparency Project found documen…",
            "content": "An Apple spokesperson told the publication that the company confirmed Lens Technology “has not received any labor transfers of Uyghur workers from Xinjiang.” The company’s supplier progress report st… [+3132 chars]"
        },
        {
            "title": "Amazon buys planes for the first time to expand its cargo air fleet",
            "description": "Back in 2016, Amazon’s cargo air fleet (then known as Prime Air) consisted of 11 jets. By the end of 2022, the company told Bloomberg it expects to have more than 85 planes shuttling products across the US and other countries thanks to its recent acquisition …",
            "content": "Back in 2016, Amazon’s cargo air fleet (then known as Prime Air) consisted of 11 jets. By the end of 2022, the company told Bloomberg it expects to have more than 85 planes shuttling products across … [+650 chars]"
        },
        {
            "title": "Amazon Purchases Podcast Network Wondery",
            "description": "On Wednesday, Amazon announced that it had a acquired Wondery, the podcast publisher best known for successful serialized shows like “Dirty John,” “Dr. Death,” “Business Wars,” and “The Shrink Next Door.”",
            "content": "One of the last large independent podcast networks in the U.S. will soon become a subsidiary of Amazon.\r\nOn Wednesday, the e-commerce giant announced that it had a acquired Wondery, the podcast publi… [+1629 chars]"
        },
        {
            "title": "Amazon is removing products promoting the QAnon conspiracy",
            "description": "Amazon has begun the process of removing QAnon-related products from its platform. A spokesperson for the company said that the process may take a few days. Any sellers that attempt to evade the company’s systems and list products will be subject to action, i…",
            "content": "Amazon has begun the process of removing QAnon-related products from its platform.\r\nA spokesperson for the company said that the process may take a few days. Any sellers that attempt to evade the com… [+2210 chars]"
        },
        {
            "title": "Amazon generates millions of pounds of plastic waste",
            "description": "Amazon hinted at the scope of its total annual plastic footprint in response to a report alleging that the company produces millions of pounds of plastic waste that wind up polluting the world’s oceans.",
            "content": "Amazon fulfilment center in Sosnowiec, Poland on 13 May, 2019.  | Photo by Beata Zawrzel/NurPhoto via Getty Images\r\n\n \n\n Amazon’s plastic pollution is under scrutiny today with the publication of a n… [+5487 chars]"
        },
        {
            "title": "Alexa's 'tell me when' command sets reminders for upcoming events",
            "description": "Amazon is making it easier to remember an event you don’t want to miss. The Verge reports that Amazon has quietly introduced a hinted-at “tell me when” Alexa command that not only answers your question about an event, but sets a reminder when that event happe…",
            "content": "Amazon is making it easier to remember an event you don’t want to miss. The Vergereports that Amazon has quietly introduced a hinted-at “tell me when” Alexa command that not only answers your questio… [+407 chars]"
        },
        {
            "title": "Amazon eyes launching its computer science education program in India",
            "description": "Amazon is planning to extend its computer science program Future Engineer to India, demonstrating its growing interest in the education space in the world’s second largest internet market. In a job recruitment post, the company said that initial research for …",
            "content": "Amazon is planning to extend its computer science program Future Engineer to India, demonstrating its growing interest in the education space in the worlds second largest internet market.\r\nIn a job r… [+2518 chars]"
        },
        {
            "title": "AWS launches CloudShell, a web-based shell for command-line access to AWS",
            "description": "AWS today launched CloudShell, a new, fully-featured web-based shell environment, based on Amazon Linux 2, for developers who want to be able to use some of their favorite command-line tools — and scripts — right inside the AWS Console. CloudShell, Amazon CTO…",
            "content": "AWS today launched CloudShell, a new, fully-featured web-based shell environment, based on Amazon Linux 2, for developers who want to be able to use some of their favorite command-line tools — and sc… [+1608 chars]"
        },
        {
            "title": "AWS introduces new Chaos Engineering as a Service offering",
            "description": "When large companies like Netflix or Amazon want to test the resilience of their systems, they use chaos engineering tools designed to help them simulate worst-case scenarios and find potential issues before they even happen. Today at AWS re:Invent, Amazon CT…",
            "content": "When large companies like Netflix or Amazon want to test the resilience of their systems, they use chaos engineering tools designed to help them simulate worst-case scenarios and find potential issue… [+1651 chars]"
        },
        {
            "title": "Parler sues Amazon, leveling far-fetched antitrust allegations",
            "description": "Parler has sued Amazon after the beleaguered conservative social media site was expelled from AWS, filing a fanciful complaint alleging the internet giant took it out for political reasons — and in an antitrust conspiracy to benefit Twitter. But its own alleg…",
            "content": "Parler has sued Amazon after the beleaguered conservative social media site was expelled from AWS, filing a fanciful complaint alleging the internet giant took it out for political reasons and in an … [+4123 chars]"
        },
        {
            "title": "This week's best deals: $60 off the Apple Watch SE and more",
            "description": "We’re officially one week away from Christmas, even though it may not feel like it, which means these are truly the final days to snag last-minute holiday gifts. Believe it or not, there are still sales you can grab and some of those gadgets could still arriv…",
            "content": "Buy the Apple Watch SE (44mm) at Amazon - $250\r\nNVIDIA Shield TV Pro\r\nThe NVIDIA Shield TV Pro is on sale for $180, which is $20 off its normal price and a rare sale for the Android TV system. But it… [+7530 chars]"
        },
        {
            "title": "20 Great Green Monday Deals on Apple, Bose, Sonos, and More",
            "description": "Whether you've heard of Green Monday or not, you should check out these holiday tech deals from Apple, Amazon, Sonos, Bose, Sony, and more.",
            "content": "<li>Apple Watch Series 62020 Versionfor $350 ($49 off): The latest Apple Watch is still our favorite smartwatch, and it's only $20 more than its Cyber Monday price right now, so it's a good time to g… [+1607 chars]"
        }
    ]
}