{
    "body": [
        {
            "title": "How to Shoot HDR Photos With an Android Go Phone",
            "description": "Earlier this year, Google launched Camera Go, a stripped-down version of its Camera app for Android Go devices. Android Go phones are entry-level devices with weaker hardware but aggressively affordable prices—usually below $100. Camera Go lacked most of the …",
            "content": "Earlier this year, Google launched Camera Go, a stripped-down version of its Camera app for Android Go devices. Android Go phones are entry-level devices with weaker hardware but aggressively afforda… [+1621 chars]"
        },
        {
            "title": "How to Stream Amazon Luna Games on Android",
            "description": "Amazon’s Luna cloud gaming service is now available for Android in the U.S., adding yet another option for playing console-quality games from anywhere on your smartphone. Using Luna on Android is simple, but there are several requirements you’ll have to addre…",
            "content": "Amazons Luna cloud gaming service is now available for Android in the U.S., adding yet another option for playing console-quality games from anywhere on your smartphone. Using Luna on Android is simp… [+1941 chars]"
        },
        {
            "title": "Firefox 84's Best New Features on Desktop and Android",
            "description": "The latest Firefox update, version 84, is now out for desktop and Android. While you’re updating your browser, let’s have a quick look at everything that’s new—especially critical if you’re sitting on a brand-new MacBook Pro, MacBook Air, or Mac Mini.Read mor…",
            "content": "The latest Firefox update, version 84, is now out for desktop and Android. While youre updating your browser, lets have a quick look at everything thats newespecially critical if youre sitting on a b… [+2043 chars]"
        },
        {
            "title": "What to Do If You Can't Make Android Auto Calls",
            "description": "Earlier this year, a bug broke Google Assistant phone calls in Android Auto after users updated to Android 11. Google fixed the issue shortly after with a system update, but the bug still shows up for some users even after installing the patch. Luckily, there…",
            "content": "Earlier this year, a bug broke Google Assistant phone calls in Android Auto after users updated to Android 11. Google fixed the issue shortly after with a system update, but the bug still shows up fo… [+1641 chars]"
        },
        {
            "title": "Where to Find Netflix's New Audio-Only Mode on Android",
            "description": "Netflix is currently testing out a special audio-only mode for its mobile apps—Android, specifically. While that’s no guarantee that the ever-so useful feature will see the light of day in a stable release, it’s promising, and if you’re lucky, you can test ou…",
            "content": "Netflix is currently testing out a special audio-only mode for its mobile appsAndroid, specifically. While thats no guarantee that the ever-so useful feature will see the light of day in a stable rel… [+2830 chars]"
        },
        {
            "title": "WhatsApp is Ditching These Old Phones in 2021 [Updated]",
            "description": "WhatsApp will soon drop support for another round of older versions of iOS and Android. As described in WhatsApp’s recently updated system requirements, you must have a device that runs at least iOS 9 or Android 4.0.3 in order to access WhatsApp after January…",
            "content": "WhatsApp will soon drop support for another round of older versions of iOS and Android. As described in WhatsApps recently updated system requirements, you must have a device that runs at least iOS 9… [+1726 chars]"
        },
        {
            "title": "Lenovo's Tab P11 Android tablet is targeted at families",
            "description": "Lenovo has released a new Android tablet at this year’s CES, though it has a rather familiar name. It’s called the Lenovo Tab P11, and it appears to be a more budget-friendly and lesser version of last year’s Tab P11 Pro. While the P11 Pro is aimed at profess…",
            "content": "Other specs include a battery life of up to 15 hours and it comes with a new kid-friendly mode called Kids Space from Google. This offers parents and children an array of family-friendly apps, books … [+1141 chars]"
        },
        {
            "title": "Google's Android Things platform will shut down in a little over a year",
            "description": "Android Things’ days are numbered. Google has revealed that the Internet-of-Things platform is joining its ever growing pile of retired products in an FAQ page for developers. The tech giant originally launched Android Things as an operating system for all ki…",
            "content": "Android Things’ days are numbered. Google has revealed that the Internet-of-Things platform is joining its ever growing pile of retired products in an FAQ page for developers. The tech giant original… [+720 chars]"
        },
        {
            "title": "How to Enable Google Assistant in Android's Chrome Browser",
            "description": "You can now use Google Assistant for voice searches in Google Chrome on Android, and not a moment too soon. The move saves Chrome users from the lackluster voice recognition you were forced to deal with previously. Read more...",
            "content": "You can now use Google Assistant for voice searches in Google Chrome on Android, and not a moment too soon. The move saves Chrome users from the lackluster voice recognition you were forced to deal w… [+1749 chars]"
        },
        {
            "title": "You Can Now Share Your Smartphone Screen in the Discord App",
            "description": "Discord has finally added screen sharing to its Android and iOS apps. You can now share your mobile device’s screen with up to 50 others in voice channels or video calls.Read more...",
            "content": "Discord has finally added screen sharing to its Android and iOS apps. You can now share your mobile devices screen with up to 50 others in voice channels or video calls.\r\nDiscord is primarily markete… [+2149 chars]"
        },
        {
            "title": "Sony’s 2021 TV lineup runs Google TV and fully embraces HDMI 2.1",
            "description": "Sony’s new Bravia XR TVs are fully optimized for the PlayStation 5 and Xbox One X with next-gen HDMI 2.1 features. They also move on from Android TV and run Google TV software.",
            "content": "Variable refresh rate, 4K at 120Hz, ALLM, and eARC are standard across the line\r\nImage: Sony\r\nLast years TV lineup from Sony took a bit of criticism since several sets were unable to take advantage o… [+3823 chars]"
        },
        {
            "title": "RIP Android Things, the Smart Home Platform We All Forgot Existed",
            "description": "While Google is infamous for killing off its creations, there’s a good chance you’ve never even heard of Android Things—a platform Google launched in 2018 for the Internet of Things. And although Google said last year it was shifting Android Things away from …",
            "content": "While Google is infamous for killing off its creations, theres a good chance youve never even heard of Android Thingsa platform Google launched in 2018 for the Internet of Things. And although Google… [+3199 chars]"
        },
        {
            "title": "Turn Microsoft's Authenticator Into a Password Manager",
            "description": "Microsoft is testing out a new password-management feature in its Authenticator app, which makes the former even more useful as a one-stop shop for all of your account-related information. It’s super easy to set up, and it enables you to synchronize your pass…",
            "content": "Microsoft is testing out a new password-management feature in its Authenticator app, which makes the former even more useful as a one-stop shop for all of your account-related information. Its super … [+1879 chars]"
        },
        {
            "title": "You Can Finally Share Tweets in Snapchat",
            "description": "Twitter and Snapchat are technically rivals in the social media marketplace, but the two companies recently joined forces to make sharing tweets in Snapchats much easier. The new cross-platform share option is available for Twitter on iOS right now, and it’ll…",
            "content": "Twitter and Snapchat are technically rivals in the social media marketplace, but the two companies recently joined forces to make sharing tweets in Snapchats much easier. The new cross-platform share… [+1824 chars]"
        },
        {
            "title": "These 19 Devices Will Lose T-Mobile Network Support Next Month",
            "description": "According to internal T-Mobile documents obtained and verified by Android Police, the company plans to drop mobile network support for 19 devices on January 29, 2021. Impacted devices include smartphones from Google, Samsung, Sony, and more, as well as older …",
            "content": "According to internal T-Mobile documents obtained and verified by Android Police, the company plans to drop mobile network support for 19 devices on January 29, 2021. Impacted devices include smartph… [+2053 chars]"
        },
        {
            "title": "Put a Virtual Baby Grogu in Your Home",
            "description": "If you haven’t already brought Baby Yoda/Grogu/The Child into your home for the holidays—whether in the form of a giant stuffed animal, a walking toy, or just obsessive rewatchings of The Mandalorian—there is another... option (to borrow Yoda’s dramatic phras…",
            "content": "If you havent already brought Baby Yoda/Grogu/The Child into your home for the holidayswhether in the form of a giant stuffed animal, a walking toy, or just obsessive rewatchings of The Mandalorianth… [+1659 chars]"
        },
        {
            "title": "How to Cash Checks in Venmo Without a Bank Account",
            "description": "Venmo will soon roll out a new “Cash a Check” deposit feature for all iOS and Android devices. It will allow all Venmo users cash a check using their mobile phone—no trips to an ATM or waiting in line at the bank necessary. The feature even works for users wh…",
            "content": "Venmo will soon roll out a new Cash a Check deposit feature for all iOS and Android devices. It will allow all Venmo users cash a check using their mobile phoneno trips to an ATM or waiting in line a… [+2001 chars]"
        },
        {
            "title": "Google's Fitbit acquisition finally gains EU approval",
            "description": "The EU has approved Google’s acquisition of Fitbit more than a year after it was announced, albeit with some catches. There are some “very limited horizontal overlaps” where Google could theoretically abuse its power, the EU said, and this would keep the digi…",
            "content": "The company is also obligated to keep giving Android device makers a free license to the software tools needed for wearables to operate with Android phones, including Google Mobile Services and all o… [+931 chars]"
        },
        {
            "title": "Discord will be able to screen share from iOS and Android devices starting today",
            "description": "The super popular chat app Discord is getting a much-requested feature starting today: mobile screen sharing. As the name suggests, mobile screen sharing lets users capture and broadcast everything on their phone’s display and stream it to a group of friends.…",
            "content": "The super popular chat app Discord is getting a much-requested feature starting today: mobile screen sharing.\r\nAs the name suggests, mobile screen sharing lets users capture and broadcast everything … [+1141 chars]"
        },
        {
            "title": "Future Snapdragon phones can get up to four years of security updates",
            "description": "Back in 2017, Google announced Project Treble, a modular redesign of Android’s low-level system architecture that was supposed to reduce the time it took for phone manufacturers to update their devices with the latest version of its mobile operating system. A…",
            "content": "That is much clearer. It's the same three years of updates you currently get with Pixels, +1 more year of security updates.\r\n— Ron Amadeo (@RonAmadeo) December 16, 2020\r\nThe first phones that will ta… [+988 chars]"
        }
    ]
}