{
    "body": [
        {
            "title": "SpaceX shows off its Starship test flight one more time",
            "description": "Taking a victory lap around the test flight that wrapped up quite a year for SpaceX, the company posted a longer video of its Starship SN8 high-altitude test flight. Its high speed impact and explosion is just a footnote, as this two-minute video marvels at t…",
            "content": "Taking a victory lap around the test flight that wrapped up quite a year for SpaceX, the company posted a longer video of its Starship SN8 high-altitude test flight. Its high speed impact and explosi… [+313 chars]"
        },
        {
            "title": "Elon Musk says SpaceX to double launch pad usage for Starship tests, Super Heavy flights coming in a ‘few months’",
            "description": "SpaceX is set to significantly ramp up its Starship development program in the new year, in more ways than one. SpaceX CEO and founder Elon Musk noted on Twitter on Thursday that the company will seek to make use of both of its two launch pads at its developm…",
            "content": "SpaceX is set to significantly ramp up its Starship development program in the new year, in more ways than one. SpaceX CEO and founder Elon Musk noted on Twitter on Thursday that the company will see… [+1863 chars]"
        },
        {
            "title": "After Math: Sony is spending a billion bucks on Crunchyroll's anime service",
            "description": "It’s been a week of big deals, big trouble (at least for Facebook), and even bigger televisions. Apple announced its new over-ear AirPods Max, Sony’s Funimation officialized its billion-dollar bid for rival Crunchyroll, and SpaceX scored a huge payday from th…",
            "content": "Once only found on the shin-level shelves in the “international” section of our local video rental shops, anime as an art form has become a global phenomenon and pillar of pop culture. Its influence … [+2313 chars]"
        },
        {
            "title": "Watch SpaceX launch a U.S. spy satellite live and bring its booster back for a landing on terra firma",
            "description": "SpaceX is launching a Falcon 9 today from Kennedy Space Center, with a launch window that spans three hours and opens at 9 AM EST (6 AM PST). The mission will carry a spy satellite for the U.S. National Reconnaissance Office (NRO), and will include a recovery…",
            "content": "SpaceX is launching a Falcon 9 today from Kennedy Space Center, with a launch window that spans three hours and opens at 9 AM EST (6 AM PST). The mission will carry a spy satellite for the U.S. Natio… [+1126 chars]"
        },
        {
            "title": "SpaceX just launched a classified spy satellite into orbit",
            "description": "The undisclosed package, called NROL-108, is a U.S. spy satellite for the National Reconnaissance Office (NRO) that was launched with a Falcon 9 rocket on December 19. It was a record 26th launch this year for SpaceX. Read more...More about Spy, Satellite, La…",
            "content": "The undisclosed package, called NROL-108, is a U.S. spy satellite for the National Reconnaissance Office (NRO) that was launched with a Falcon 9 rocket on December 19. It was a record 26th launch thi… [+17 chars]"
        },
        {
            "title": "Elon Musk becomes world's richest person worth $185bn",
            "description": "The Tesla and SpaceX owner replaces Jeff Bezos as the richest man on the planet.",
            "content": "Elon Musk has become the world's richest person, as his net worth crossed $185bn (£136bn).\r\nThe Tesla and SpaceX entrepreneur was pushed into the top slot after Tesla's share price increased on Thurs… [+1633 chars]"
        },
        {
            "title": "A deep dive on Steve Jurvetson and Maryanna Saenko’s $200 million new fund",
            "description": "Future Ventures — cofounded by renowned VC Steve Jurvetson and Maryanna Saenko, a colleague of Jurvetson at his last firm, DFJ, as well as an investor previously with Airbus Ventures and Khosla Ventures — has closed its second fund with $200 million in capita…",
            "content": "Future Ventures — cofounded by renowned VC Steve Jurvetson and Maryanna Saenko, a colleague of Jurvetson at his last firm, DFJ, as well as an investor previously with Airbus Ventures and Khosla Ventu… [+5833 chars]"
        },
        {
            "title": "Five easy ways for Elon Musk to combine his companies into a superconglomerate",
            "description": "Elon Musk says creating a holding company above Tesla, SpaceX, Neuralink, and The Boring Company is a “good idea.” It’s not that far-fetched an idea — after all, this is what Google did with Alphabet — so here are five ways he could do it.",
            "content": "Photo by Pauline Acalin for The Verge\r\n\n \n\n Elon Musk thinks it’s a “good idea” to create a holding company above Tesla, SpaceX, Neuralink, and The Boring Company — at least, that’s what the billiona… [+8054 chars]"
        },
        {
            "title": "The Morning After: 'Cyberpunk 2077' got its first post-launch patch",
            "description": "This week’s news swung between some ridiculous extremes. CD Projekt Red released Cyberpunk 2077 without addressing many of the issues people had with its design choices, marketing, development crunch or performance on older consoles -- and still set records. …",
            "content": "This week’s news swung between some ridiculous extremes. CD Projekt Red released Cyberpunk 2077 without addressing many of the issues people had with its design choices, marketing, development crunch… [+2078 chars]"
        },
        {
            "title": "Elon Musk dunks on Facebook and recommends Signal in wake of U.S. Capitol insurrection attempt",
            "description": "Elon Musk, the tech billionaire set to likely soon become the world’s richest man, and one of the most influential voices in the world of tech entrepreneurship, continued his recent trend of criticizing Facebook with a Twitter post late Wednesday night, follo…",
            "content": "Elon Musk, the tech billionaire set to likely soon become the world’s richest man, and one of the most influential voices in the world of tech entrepreneurship, continued his recent trend of criticiz… [+1327 chars]"
        },
        {
            "title": "Magdrive secures Seed funding for new propulsion system which could take us to the stars",
            "description": "A startup with a new type of spacecraft propulsion system could make the interplanetary travel seen in Star Trek a reality. Magdrive has just closed a £1.4M seed round led by Founders Fund, an early investor in SpaceX, backed by Luminous Ventures, 7percent Ve…",
            "content": "A startup with a new type of spacecraft propulsion system could make the interplanetary travel seen in Star Trek a reality. Magdrive has just closed a £1.4M seed round led by Founders Fund, an early … [+3921 chars]"
        },
        {
            "title": "NASA opens new launchpad at Kennedy Space Center meant to serve multiple commercial launch customers",
            "description": "NASA has finished work on a new launchpad at its Kennedy Space Center in Florida – Launch Complex 48 (LC-48), a pad that will be able to support smaller launch vehicles than either LC-39A or B, or SLC-41, which currently host SpaceX, SLS and ULA launches resp…",
            "content": "NASA has finished work on a new launchpad at its Kennedy Space Center in Florida Launch Complex 48 (LC-48), a pad that will be able to support smaller launch vehicles than either LC-39A or B, or SLC-… [+1536 chars]"
        },
        {
            "title": "SpaceX Will Try to ‘Catch’ Its Starship Boosters Instead of Landing Them",
            "description": "Not content to keep things simple or easy, SpaceX plans to catch its upcoming Super Heavy booster rockets at the launch tower, allowing for subsequent relaunches a mere one hour later. Read more...",
            "content": "Not content to keep things simple or easy, SpaceX plans to catch its upcoming Super Heavy booster rockets at the launch tower, allowing for subsequent relaunches a mere one hour later. \r\nNot to be co… [+1985 chars]"
        },
        {
            "title": "Amazon’s Project Kuiper reveals design of antennas customers will use for internet-from-space constellation",
            "description": "On December 16th, Amazon unveiled the design of the user antennas customers will use to receive internet from the company’s massive future satellite constellation, Project Kuiper.",
            "content": "Amazon claims they are smaller and lighter than legacy antennas\r\nA graphic showing the design of Amazons user antenna\r\nImage: Amazon\r\nToday, Amazon revealed the design of the antennas its customers w… [+3351 chars]"
        },
        {
            "title": "Elon Musk has a new title: world’s richest person",
            "description": "Elon Musk, the controversial and enigmatic entrepreneur who heads up SpaceX and Tesla, has reached a status that only three others have held in the past two decades: world’s richest person. On his way to the top spot, Musk has surpassed a bevy of billionaires…",
            "content": "Elon Musk, the controversial and enigmatic entrepreneur who heads up SpaceX and Tesla, has reached a status that only three others have held in the past two decades: world’s richest person.\r\nOn his w… [+1890 chars]"
        },
        {
            "title": "NASA approves Blue Origin's New Glenn for future uncrewed missions",
            "description": "NASA has approved Blue Origin’s New Glenn heavy lift rocket for future unmanned scientific and exploration missions, even though the 310 foot reusable booster has yet to fly. The contract, part of the space agency’s NASA Launch Services (NLS), is an important…",
            "content": "SpaceX’s Falcon and Falcon Heavy rockets have both been approved by NASA under the same category, but only the Falcon has flown NASA missions, while the Falcon Heavy has flown two private commercial … [+1188 chars]"
        },
        {
            "title": "SpaceX launches classified satellite into space, its last mission of 2020 - 10 Tampa Bay",
            "description": "<ol><li>SpaceX launches classified satellite into space, its last mission of 2020  10 Tampa Bay\r\n</li><li>SpaceX makes its last launch of the year successfully  Entrepreneur\r\n</li><li>SpaceX launches classified US spy satellite into orbit on final 2020 missio…",
            "content": null
        },
        {
            "title": "SpaceX just launched a powerful Sirius XM satellite into orbit and nailed a rocket landing - Space.com",
            "description": "<ol><li>SpaceX just launched a powerful Sirius XM satellite into orbit and nailed a rocket landing  Space.com\r\n</li><li>SpaceX launches satellite for SiriusXM radio from Cape Canaveral  Orlando Sentinel\r\n</li><li>Updates: Watch SpaceX launch SiriusXM satellit…",
            "content": "CAPE CANAVERAL, Fla. SpaceX\r\n launched a veteran Falcon 9 rockets on its seventh trip to space Sunday (Dec. 13) to carry a massive radio satellite into orbit for Sirius XM and then return to Earth.\r\n… [+7700 chars]"
        },
        {
            "title": "SpaceX scrubs Falcon 9 launch to assess second stage issue - Spaceflight Now",
            "description": "<ol><li>SpaceX scrubs Falcon 9 launch to assess second stage issue  Spaceflight Now\r\n</li><li>Watch SpaceX launch a US spy satellite live and bring its booster back for a landing on terra firma  TechCrunch\r\n</li><li>Last SpaceX launch of the year will boost a…",
            "content": "EDITOR’S NOTE: Updated at 2 a.m. EST (0700 GMT) with delay to Saturday.\r\nSpaceX’s Falcon 9 rocket stands on pad 39A at the Kennedy Space Center on Thursday after an aborted countdown. Credit: SpaceX\r… [+1815 chars]"
        },
        {
            "title": "SiriusXM's New SXM-7 Satellite, Built by Maxar and Launched Aboard A SpaceX Falcon 9, Performing Properly After Launch - Space Ref",
            "description": "<ol><li>SiriusXM's New SXM-7 Satellite, Built by Maxar and Launched Aboard A SpaceX Falcon 9, Performing Properly After Launch  Space Ref\r\n</li><li>SpaceX launches satellite in company's 25th flight to orbit in 2020  Global News\r\n</li><li>SpaceX Falcon 9 lift…",
            "content": "SiriusXM's New SXM-7 Satellite, Built by Maxar and Launched Aboard A SpaceX Falcon 9, Performing Properly After Launch\r\nPress Release\r\n From: Maxar TechnologiesPosted: Monday, December 14, 2020 \r\nMax… [+4901 chars]"
        }
    ]
}