{
    "body": [
        {
            "title": "NYSE reverses plans to delist China’s three big telcos",
            "description": "In an unexpected turn, the New York Stock Exchange said Monday that it no longer intends to delist China’s three major telecoms operators, a decision that was originally announced on December 31. The initial action targeted China Mobile, China Unicom and Chin…",
            "content": "In an unexpected turn, the New York Stock Exchange said Monday that it no longer intends to delist China’s three major telecoms operators, a decision that was originally announced on December 31.\r\nTh… [+2301 chars]"
        },
        {
            "title": "Chinese facial recognition unicorn Megvii prepares China IPO",
            "description": "Megvii, one of China’s largest facial recognition startups, is gearing up for an initial public offering in Shanghai. The company is working with CITIC Securities to prepare for its planned listing, according to an announcement posted by the China Securities …",
            "content": "Megvii, one of China’s largest facial recognition startups, is gearing up for an initial public offering in Shanghai. The company is working with CITIC Securities to prepare for its planned listing, … [+2263 chars]"
        },
        {
            "title": "China Considers Hefty Fines For Viral Video Creators Who Binge Food and Drinks",
            "description": "Lawmakers in China are considering new legislation that would impose fines against anyone who creates videos where people eat large quantities of food or binge drinks, according to a new report from Chinese state media outlet China News. The proposed media ru…",
            "content": "Lawmakers in China are considering new legislation that would impose fines against anyone who creates videos where people eat large quantities of food or binge drinks, according to a new report from … [+3979 chars]"
        },
        {
            "title": "Department of Homeland Security tells US businesses to avoid Chinese tech",
            "description": "The Department of Homeland Security has today published a report saying US companies should avoid “data services and equipment” from companies in China. The 15-page report says that businesses are exposing “themselves and their customers to heightened risk” w…",
            "content": "“Stolen intellectual property,” adds the document, has been “essential” to bolstering the technical knowledge and capabilities of the People’s Liberation Army. And as well as stolen knowledge, the re… [+809 chars]"
        },
        {
            "title": "Why China Turned Against Alibaba's Jack Ma",
            "description": "The Alibaba chief paid for pushing back against Beijing. But the shift in attitude also speaks to a growing wealth gap and diminished opportunities for the young.",
            "content": "Mr. Xi made no secret about what his ideal capitalist should be like. Ten days after the Ant I.P.O. debacle, he toured a museum exhibition devoted to Zhang Jian, an industrialist who was active more … [+1708 chars]"
        },
        {
            "title": "China Approves Its First Coronavirus Vaccine",
            "description": "The country is now set to inoculate tens of millions. A tiny Colorado town is grappling with the first detected U.S. cases of the new virus variant. Covid widows are forging bonds. Good riddance, 2020! Here’s the latest pandemic news.",
            "content": "LiveUpdated Dec. 31, 2020, 5:04 a.m. ET\r\nDec. 31, 2020, 5:04 a.m. ET\r\nThe country is now set to inoculate tens of millions. A tiny Colorado town is grappling with the first detected U.S. cases of the… [+20151 chars]"
        },
        {
            "title": "China pushes Alibaba founder Jack Ma to downsize his finance business",
            "description": "China’s crackdown on Jack Ma’s empire is far from over: The country’s regulators have ordered the Ma-founded Alibaba affiliate Ant Group to scale down its business. In particular, they’ve ordered the company to “return to its origins” as a payment provider. A…",
            "content": "China’s crackdown on Jack Ma’s empire is far from over: The country’s regulators have ordered the Ma-founded Alibaba affiliate Ant Group to scale down its business. In particular, they’ve ordered the… [+1005 chars]"
        },
        {
            "title": "Apple celebrates the Year of the Ox with limited AirPods Pro in Asia",
            "description": "Apple has introduced a limited edition version of the AirPods Pro with a special emoji engraving to celebrate the Year of the Ox. They’re available in China, Taiwan, Hong Kong, Singapore, and Malaysia.",
            "content": "Some countries get AirPods Pro with a new emoji engraving\r\nFebruary 12th marks the first day of Lunar New Year, with 2021 ushering in the Year of the Ox and saying farewell to the Year of the Rat. To… [+942 chars]"
        },
        {
            "title": "China investigates Alibaba over 'monopoly tactics'",
            "description": "The Chinese tech giant is face a probe by regulators into locking merchants into its platform.",
            "content": "image copyrightGetty Images\r\nChinese tech giant Alibaba is being investigated by regulators over monopolistic practices.\r\nChina's State Administration for Market Regulation (SAMR) made the announceme… [+2021 chars]"
        },
        {
            "title": "Twitter deletes China embassy's Xinjiang 'emancipation' tweet",
            "description": "China had claimed its birth control policies - widely seen as a crackdown - gave women more freedom.",
            "content": "image copyrightGetty Images\r\nimage captionA file photo shows a woman holding a baby in Xinjiang province\r\nTwitter has deleted a post from China's US embassy which claimed Uighur women had had their m… [+3041 chars]"
        },
        {
            "title": "New Report Claims Apple Supplier Uses Forced Labor in China",
            "description": "While Apple says it has a thorough system of checks to ensure components used in its products are produced in an ethical manner, a new report claims that well known Apple supplier Lens Technology uses forced labor comprised of Uighur Muslim workers in China. …",
            "content": "While Apple says it has a thorough system of checks to ensure components used in its products are produced in an ethical manner, a new report claims that well known Apple supplier Lens Technology use… [+3498 chars]"
        },
        {
            "title": "Apple, Amazon and Tesla supplier accused of using forced labor",
            "description": "According to an investigation by The Washington Post and the Tech Transparency Project, companies including Apple, Amazon and Tesla are sourcing parts from a Chinese supplier that allegedly uses forced Muslim labor. The Tech Transparency Project found documen…",
            "content": "An Apple spokesperson told the publication that the company confirmed Lens Technology “has not received any labor transfers of Uyghur workers from Xinjiang.” The company’s supplier progress report st… [+3132 chars]"
        },
        {
            "title": "Covid-19: China approves Sinopharm vaccine for general use",
            "description": "The Sinopharm vaccine is the first in China to be approved beyond emergency use.",
            "content": "image copyrightGetty Images\r\nimage captionBoth the UAE and Bahrain have already granted emergency use of the Sinopharm vaccine for key workers\r\nChinese authorities have given conditional approval for… [+5528 chars]"
        },
        {
            "title": "Tesla launches the world's largest Supercharger station in Shanghai",
            "description": "Tesla has launched the world’s largest Supercharger station in China, the company announced on Wiebo. The 72-stall facility in Shanghai easily bests the 56 stall station the company opened last month in Fresno county, California, as Electrek noted. Unlike the…",
            "content": "Tesla has launched the world’s largest Supercharger station in China, the company announced on Wiebo. The 72-stall facility in Shanghai easily bests the 56 stall station the company opened last month… [+832 chars]"
        },
        {
            "title": "Fou Ts’ong, Famed Chinese Pianist, Dies of Covid-19 at 86",
            "description": "Driven from China during Mao’s rule, Mr. Fou kept up a correspondence with his father that became a beloved book in the wake of the Cultural Revolution.",
            "content": "Then, in 1966, Mao unleashed the Cultural Revolution, a decade-long period of chaos that upended Chinese society. Militant Red Guards accused Mr. Fu, a prolific translator of writers like Balzac and … [+1613 chars]"
        },
        {
            "title": "Drone Giant DJI Added to U.S. Blacklist",
            "description": "The U.S. Commerce Department on Friday added drone maker DJI to its “Entity List,” effectively banning U.S. companies from doing business with the China-based firm.Read more...",
            "content": "The U.S. Commerce Department on Friday added drone maker DJI to its Entity List, effectively banning U.S. companies from doing business with the China-based firm.\r\nThe addition of DJI to the Entity L… [+2701 chars]"
        },
        {
            "title": "China-E.U. Talks Hit Another Snag as Biden Camp Objects",
            "description": "Beijing and Brussels were on the brink of an agreement to roll back restrictions on investment. But the deal’s fate is uncertain amid growing animosity toward China and increasingly vocal opposition.",
            "content": "While a deal with China in the short term would not preclude other partnerships between Europe and the United States, it would undercut some of Mr. Bidens rhetoric and demonstrate that Western compan… [+1619 chars]"
        },
        {
            "title": "Citing Coal Shortages, China Rations Electricity for Millions",
            "description": "Warning of coal shortages, officials are trying to curb energy usage by telling residents not to use electric stoves and extinguishing lights on building facades and billboards.",
            "content": "Hes got to wrestle with economic growth, economic structures, employment and the environment, Philip Andrews-Speed, senior principal fellow at the Energy Studies Institute at the National University … [+1699 chars]"
        },
        {
            "title": "Tesla’s China rival Xpeng to use lidar sensors from DJI affiliate Livox",
            "description": "The battle is heating up between Tesla and its Chinese challenger Xpeng as the latter makes clearer its stance on the future of autonomous driving. Over the weekend, Xpeng, which counts Xiaomi and Alibaba among its investors, announced that it will be using l…",
            "content": "The battle is heating up between Tesla and its Chinese challenger Xpeng as the latter makes clearer its stance on the future of autonomous driving. Over the weekend, Xpeng, which counts Xiaomi and Al… [+3646 chars]"
        },
        {
            "title": "China warns of interference over Bloomberg journalist arrest",
            "description": "International pressure is mounting after a Chinese Bloomberg journalist was detained by Beijing.",
            "content": "image copyrightGetty Images\r\nimage captionIt's not yet clear why the journalist Haze Fan has been detained.\r\nChina has said the arrest of a journalist working for the newswire Bloomberg is an \"intern… [+3245 chars]"
        }
    ]
}