{
    "body": [
        {
            "title": "Better Security, Harry Potter Style",
            "description": "We all know we shouldn’t use 1234 as our password. But we often don’t do the absolute best practice when it comes to passwords. After all, you should have some obscure strange password that is unique for every site. But we all have lots of passwords, so most …",
            "content": "We all know we shouldn’t use 1234 as our password. But we often don’t do the absolute best practice when it comes to passwords. After all, you should have some obscure strange password that is unique… [+2900 chars]"
        },
        {
            "title": "This Working Marauder's Map Built Using AR and GPS Brings Magic to Our World",
            "description": "Many of the things we see on TV or movies can often only be explained with the word “magic” (or, your know, visual effects.) What would it be like if the magical inventions we see on our screens existed in real life? Now, at least one does, and you apparently…",
            "content": "Many of the things we see on TV or movies can often only be explained with the word magic (or, your know, visual effects.) What would it be like if the magical inventions we see on our screens existe… [+6040 chars]"
        },
        {
            "title": "How the pandemic inspired creative uses of technology in 2020",
            "description": "The coronavirus pandemic brought stress and chaos to everyone’s lives as we worked and schooled at home. But lockdowns inspired some creative uses of technology that made the isolation a little less intense and a lot more entertaining.",
            "content": "Josh Gad’s Reunited Apart brought together the cast of the Lord of the Rings movies\r\n\n \n\n The year that brought us the coronavirus pandemic, murder hornets, and the deaths of Ruth Bader Ginsburg and … [+5797 chars]"
        },
        {
            "title": "‘Harry Potter’ Actor Reveals Infant Son Hospitalized With COVID-19",
            "description": "\"Once again I’m in awe of nurses and doctors,\" the actor wrote on Instagram.",
            "content": "“Harry Potter” star Jessie Cave has announced that her infant son tested positive for COVID-19, but that she wants fans to know he’s doing well.\r\nAs a national lockdown in England has begun due to th… [+1328 chars]"
        },
        {
            "title": "11 things the 'Harry Potter' cast loved about making the films, and 8 things they hated",
            "description": "Actors like Daniel Radcliffe and Tom Felton have some heartwarming and hilarious memories from their time in the iconic fantasy movies.",
            "content": "Daniel Radcliffe didn't like filming the quidditch scenes. Warner Bros.\r\n<ul><li>The cast of the \"Harry Potter\" movies featured a mix of new-comer and veteran actors who all have memorable stories fr… [+12313 chars]"
        },
        {
            "title": "You Might Think You Know About Movies, But This Endless Sequel Quiz Will Test You In Unimaginable Ways",
            "description": "Let's see if you can remember just how many Harry Potter / X-Men / Avengers movies there really are.View Entire Post ›",
            "content": "Let's see if you can remember just how many Harry Potter/X-Men/Avengers movies there really are."
        },
        {
            "title": "Julie Walters health: ‘Feel like a different person’ Actress discusses cancer diagnosis - Express",
            "description": "<ol><li>Julie Walters health: ‘Feel like a different person’ Actress discusses cancer diagnosis  Express\r\n</li><li>Clare Balding health: BBC sport presenter describes her cancer journey - symptoms  Express\r\n</li><li>View Full coverage on Google News</li></ol>",
            "content": "Iconic actress Dame Julie Walters has said that she feels like a “different person” after having to overcome bowel cancer.\r\nSpeaking to Lorraine Kelly on Good Morning Britain, the 70-year-old actor e… [+625 chars]"
        },
        {
            "title": "Deals: Apple Updates iTunes Movies With Sales on Holiday Classics, Recent Releases, Franchise Bundles, and More",
            "description": "Apple today updated the iTunes Movies storefront with a fresh crop of deals on movies, including the expected discounts on popular holiday classics. This includes holiday films for between $8 and $10, family-friendly movies for $10, and Christmas themed genre…",
            "content": "Apple today updated the iTunes Movies storefront with a fresh crop of deals on movies, including the expected discounts on popular holiday classics. This includes holiday films for between $8 and $10… [+988 chars]"
        },
        {
            "title": "Rupert Grint über Vaterschaft: »Es ist eine ganz andere Liebe«",
            "description": "Rupert Grint ist seit einigen Monaten Vater. Von der Veränderung in seinem Privatleben profitiere er auch bei seiner Arbeit als Schauspieler, sagt der »Harry Potter«-Star.",
            "content": null
        },
        {
            "title": "The Twitter fancams that got us through 2020",
            "description": "This year, we all collectively spent more time on social media than we needed. While many of us mindlessly scrolled, just looking for something to distract ourselves from the world around us, there were a bunch of Twitter users who were actively dedicated to …",
            "content": "This year, we all collectively spent more time on social media than we needed. While many of us mindlessly scrolled, just looking for something to distract ourselves from the world around us, there w… [+2555 chars]"
        },
        {
            "title": "‘I don’t think JK Rowling is transphobic’ says gender-fluid comic Eddie Izzard - Evening Standard",
            "description": "<ol><li>‘I don’t think JK Rowling is transphobic’ says gender-fluid comic Eddie Izzard  Evening Standard\r\n</li><li>Eddie Izzard: ‘Call me she or he – my brain is coded both ways’  Telegraph.co.uk\r\n</li><li>Eddie Izzard defends JK Rowling and insists 'she isn'…",
            "content": "Harry Potter author Rowling, 55, has attracted criticism for comments on gender identity but vehemently denies she is transphobic.\r\nIzzard, 58, recently sparked headlines when referred to as \"she/her… [+971 chars]"
        },
        {
            "title": "If You Can Solve This Harry Potter Murder Mystery, You're Basically An Auror",
            "description": "Accio, murderer!View Entire Post ›",
            "content": "Editor's note: BuzzFeed does not support discriminatory or hateful speech in any form. We stand by the LGBTQ community and all fans who found a home in the Harry Potter series and will work to provid… [+104 chars]"
        },
        {
            "title": "Who Do You Think Would Win If These \"Harry Potter\" Villains Battled It Out?",
            "description": "The baddest of the baddies.View Entire Post ›",
            "content": "Lastly, Dolores Umbridge vs. Marge Dursley"
        },
        {
            "title": "18 Clever \"Harry Potter\" Movie Details That Are Honestly So Freaking Clever",
            "description": "When Hermione describes the Love Potion in Half-Blood Prince, it turns from green to orange to reflect her love for Ron.View Entire Post ›",
            "content": "Editor's note: BuzzFeed does not support discriminatory or hateful speech in any form. We stand by the LGBTQ community and all fans who found a home in the Harry Potter series, and will work to provi… [+105 chars]"
        },
        {
            "title": "The Ultimate ‘True or False’ Harry Potter Quiz",
            "description": "True or false: Rolanda Hooch's first name was never actually mentioned in the 'Harry Potter' books.",
            "content": null
        },
        {
            "title": "Remember those moving, 3D portraits from Harry Potter? They’re a real thing now!",
            "description": "Remember those moving, 3D portraits from Harry Potter? They’re a real thing now!I’m a firm believer in the fact that sci-fi movies help mold culture, and that in turn helps define innovation. If it hadn’t been for Back...",
            "content": "I’m a firm believer in the fact that sci-fi movies help mold culture, and that in turn helps define innovation. If it hadn’t been for Back To The Future, hoverboards and self-tying shoes wouldn’t be … [+7659 chars]"
        },
        {
            "title": "Infamously Bad 2000s 'Harry Potter' Fan Fiction, 'My Immortal', Immortalized On TikTok",
            "description": "'The Room' of 'Harry Potter' Fan fiction is back -- and terrifying zoomers.",
            "content": "Harry Potter aficionados and Emo kids, rejoice! My Immortal, the infamously bad mid-2000's Harry Potter fan fiction is back and ready to enthrall a new generation-- this time in the form of a viral T… [+2830 chars]"
        },
        {
            "title": "This Entrepreneur Is Building a Platform to Inspire the Next Elon Musk",
            "description": "Ali Albazaz discusses his company's mission to give exposure to new voices.",
            "content": "December\r\n17, 2020\r\n5 min read\r\nIn this ongoing series, we are sharing advice, tips and insights from real entrepreneurs who are out there doing business battle on a daily basis. (Answers have been e… [+4922 chars]"
        },
        {
            "title": "Zendaya Goes Undercover On The Internet And Answers Some Popular Questions On Twitter And YouTube",
            "description": "For her favorite \"Harry Potter\" question, Zendaya has a surprisingly (un)conventional answer.",
            "content": "Last week, it seemed like everyone was getting new logos. It started with Kia, which rang in its pointy rebranding with a fireworks show. By Friday, General Motors had a surprise new look too, its fi… [+113 chars]"
        },
        {
            "title": "Las mejores prendas de vestir para no pasar frío estas Navidades",
            "description": "Para los más pequeños, esta bata de Harry Potter. Un modelo sacado directamente de las películas con el que tu hijo parecerá todo un alumno de Hogwarts. Hec...",
            "content": "Es difícil no pasar frío durante el invierno. Los cambios bruscos de temperatura nunca resultan agradables, por lo que cada año buscamos formas diversas de combatir el frío. Desde la propia vestiment… [+1919 chars]"
        }
    ]
}