{
    "body": [
        {
            "title": "Bitcoin passes $20k and reaches all-time high",
            "description": "After reaching a previous all-time high on November 30th, 2020 and December 1st, 2020, bitcoin is now trading well above $20,000 and has surpassed its previous peak price. Bitcoin’s value has rapidly increased over the past two months. According to CoinMarket…",
            "content": "After reaching a previous all-time high on November 30th, 2020 and December 1st, 2020, bitcoin is now trading well above $20,000 and has surpassed its previous peak price.\r\nBitcoins value has rapidly… [+1062 chars]"
        },
        {
            "title": "Bitcoin Blows Past $20,000 Milestone",
            "description": "It’s been almost three years to the day since the price of Bitcoin was close to breaking the $20,000 ceiling and came crashing down. On Wednesday, the arbitrary milestone of hodlers’ dreams was finally achieved. Read more...",
            "content": "Its been almost three years to the day since the price of Bitcoin was close to breaking the $20,000 ceiling and came crashing down. On Wednesday, the arbitrary milestone of hodlers dreams was finally… [+1273 chars]"
        },
        {
            "title": "Is rising usage driving crypto’s recent price boom?",
            "description": "Do the price gains make sense in the short-term? Who knows. But they are not based on nothing.",
            "content": "Everything is dumb until it works.\r\nAs 2020 comes to a close, the cryptocurrency world is experiencing another late-year surge of consumer interest as prices climb in value. Bitcoin is over $23,000 a… [+1705 chars]"
        },
        {
            "title": "India Weighs 18% Tax on Bitcoin After Legalization of Cryptocurrencies",
            "description": "The government of India is considering an 18% tax on all bitcoin transactions, according to a new report from the Times of India. It’s not clear whether the proposed goods and services tax (GST) would apply to other cryptocurrencies like ether, the second lar…",
            "content": "The government of India is considering an 18% tax on all bitcoin transactions, according to a new report from the Times of India. Its not clear whether the proposed goods and services tax (GST) would… [+1397 chars]"
        },
        {
            "title": "Bitcoin Keeps Moving On Up, Reaching $33,000 in Value",
            "description": "Just weeks after it shattered its yearslong aspiration of reaching $20,000 in value, Bitcoin is at it again. On Saturday, the cryptocurrency passed $33,000 in value, according to CoinDesk, before dipping slightly throughout the day.Read more...",
            "content": "Just weeks after it shattered its yearslong aspiration of reaching $20,000 in value, Bitcoin is at it again. On Saturday, the cryptocurrency passed $33,000 in value, according to CoinDesk, before dip… [+2123 chars]"
        },
        {
            "title": "Bitcoin soars past $33,000, its highest ever",
            "description": "Bitcoin has been flirting with the $30,000 mark for weeks, and finally passed that record-setting level Saturday. The virtual currency is now valued at above $33,000, an all-time high.",
            "content": "New York (CNN Business)Bitcoin has been flirting with the $30,000 mark for weeks, and finally passed that record-setting level Saturday. The virtual currency is now valued at above $33,000, an all-ti… [+2108 chars]"
        },
        {
            "title": "Ripple Claims Bitcoin Is 'Chinese-Controlled' While Announcing New Lawsuit From SEC",
            "description": "The Securities and Exchange Commission plans to sue Ripple in federal civil court for selling unregistered securities, according to a news release published online by the cryptocurrency company late Monday. Ripple defended its cryptocurrency, known as XRP, as…",
            "content": "The Securities and Exchange Commission plans to sue Ripple in federal civil court for selling unregistered securities, according to a news release published online by the cryptocurrency company late … [+2950 chars]"
        },
        {
            "title": "Bitcoin hits all-time high rising above $20,000",
            "description": "The virtual currency has gained more than 170% this year amid stock market turmoil during the pandemic.",
            "content": "image copyrightGetty Images\r\nBitcoin has hit a new all-time high breaking through $20,000 (£14,800).\r\nThe volatile virtual currency has gained more than 170% this year amid stock market turmoil.\r\nOn … [+1999 chars]"
        },
        {
            "title": "Bitcoin blasts through $30K - Seeking Alpha",
            "description": "<ol><li>Bitcoin blasts through $30K  Seeking Alpha\r\n</li><li>Bitcoin Hits $31K for First Time, an Hour After Tearing Through $30K  Yahoo Finance\r\n</li><li>Bitcoin Value Leaps Over the $31K Handle, BTC Sees an All-Time Price High in 2021 | Market Updates  Bitc…",
            "content": null
        },
        {
            "title": "Months later, the great Twitter hack still boggles my mind",
            "description": "On July 15th, some of the most-followed Twitter accounts on the planet posted cryptocurrency scams because of a massive Twitter hack. It was one of the wildest stories of the year.",
            "content": "Illustration by Grayson Blackmon / The Verge\r\n\n \n\n One of the wildest stories of the year was the day some of the most-followed Twitter accounts on the planet posted cryptocurrency scams because of a… [+4340 chars]"
        },
        {
            "title": "Bitcoin price passes $20,000, setting new record",
            "description": "The value of the world's bitcoins is around $380 billion.",
            "content": "6 with 6 posters participating\r\nThe price of one bitcoin rose above $20,000 on Wednesday. The new all-time record caps a year of gains for the world's most valuable cryptocurrency. The value of all b… [+2429 chars]"
        },
        {
            "title": "Bitcoin Surges 25% In One Week. Warren Buffett Still Won't Buy It",
            "description": "Last Sunday we reported Bitcoin's price had surged 50% in the previous month. \n\nIn the week since it's surged another 24.8%. \n\nAs Bitcoin celebrates its 12th anniversary, a Forbes columnist writes that Bitcoin \"soared to $34,000 yesterday — but here's why War…",
            "content": "Last Sunday we reported Bitcoin's price had surged 50% in the previous month.In the week since it's surged another 24.8%.\r\nAs Bitcoin celebrates its 12th anniversary, a Forbes columnist writes that B… [+1428 chars]"
        },
        {
            "title": "Bitcoin breaks above $20,000 for first time - Reuters India",
            "description": "Bitcoin smashed through $20,000 for the first time on Wednesday, its highest ever.",
            "content": "By Reuters Staff\r\nFILE PHOTO: Representations of Bitcoin and U.S. dollar banknotes are seen in this illustration taken January 6, 2020. REUTERS/Dado Ruvic/File Photo\r\nLONDON (Reuters) - Bitcoin smash… [+875 chars]"
        },
        {
            "title": "Bitcoin breaks above $20,000 for first time - Reuters",
            "description": "Bitcoin smashed through $20,000 for the first time on Wednesday, its highest ever.",
            "content": "By Reuters Staff\r\nFILE PHOTO: A representation of virtual currency Bitcoin is seen in front of a stock graph in this illustration taken November 19, 2020. REUTERS/Dado Ruvic/Illustration\r\nLONDON (Reu… [+925 chars]"
        },
        {
            "title": "From automation to Bitcoin, Canadian investors see opportunity in 2021 - Reuters UK",
            "description": "From automation to Bitcoin, Canadian investors see opportunity in 2021  Reuters UK",
            "content": "Business News\r\nFergal Smith\r\nMaiya Keidan\r\nTORONTO (Reuters) - Canadian fund managers are revamping their portfolios, picking cyclical stocks that could benefit from a return to a more typical econom… [+4492 chars]"
        },
        {
            "title": "Bitcoin hits record $28,599.99 as 2020 rally powers on - Reuters",
            "description": "Bitcoin on Wednesday hit a record $28,599.99, taking gains this year past 295%.",
            "content": "By Reuters Staff\r\nLONDON, Dec 30 (Reuters) - Bitcoin on Wednesday hit a record $28,599.99, taking gains this year past 295%.\r\nThe worlds most popular cryptocurrency was last up 3.5% at $28,349. Since… [+127 chars]"
        },
        {
            "title": "Bitcoin Holds Near Record, Ether Surges Amid Crypto Rally - Bloomberg",
            "description": "<ol><li>Bitcoin Holds Near Record, Ether Surges Amid Crypto Rally  Bloomberg\r\n</li><li>Bitcoin price passes new milestone of US$ 34000  Arirang News\r\n</li><li>Ethereum Breaks Past $900 As Altcoins Go Nuts  Decrypt\r\n</li><li>Bitcoin Blasts Past $34K for First …",
            "content": null
        },
        {
            "title": "Bitcoin slumps 14% after weekend surge - Reuters",
            "description": "Bitcoin slumped 14% to $27,805 on Monday, losing ground after making dramatic gains over the new year break.",
            "content": "By Reuters Staff\r\nLONDON, Jan 4 (Reuters) - Bitcoin slumped 14% to $27,805 on Monday, losing ground after making dramatic gains over the new year break.\r\nThe worlds most popular cryptocurrency surged… [+248 chars]"
        },
        {
            "title": "Bitcoin trades near Sunday record - Reuters.com",
            "description": "Bitcoin traded at $33,365 in Asia on Monday, after soaring to a record high of $34,800 on Sunday as investors continue to bet the digital currency is on its way to becoming a mainstream asset.",
            "content": "Posted \r\nBitcoin traded at $33,365 in Asia on Monday, after soaring to a record high of $34,800 on Sunday as investors continue to bet the digital currency is on its way to becoming a mainstream asse… [+1 chars]"
        },
        {
            "title": "Bitcoin trades near Sunday record - Reuters.com",
            "description": "Bitcoin traded at $33,365 in Asia on Monday, after soaring to a record high of $34,800 on Sunday as investors continue to bet the digital currency is on its way to becoming a mainstream asset. Francis Maguire reports.",
            "content": "Posted \r\nBitcoin traded at $33,365 in Asia on Monday, after soaring to a record high of $34,800 on Sunday as investors continue to bet the digital currency is on its way to becoming a mainstream asse… [+26 chars]"
        }
    ]
}