{
    "body": [
        {
            "title": "What's New on Netflix in January 2021",
            "description": "For someone who spends a lot of time cursing nostalgia culture and lamenting the fact that the vast majority of new entertainment—from movies to Broadway musicals—seems to exist only to milk a little bit more money out of some valuable IP, I sure do love Netf…",
            "content": "For someone who spends a lot of time cursing nostalgia culture and lamenting the fact that the vast majority of new entertainmentfrom movies to Broadway musicalsseems to exist only to milk a little b… [+4571 chars]"
        },
        {
            "title": "Netflix and Arthur Conan Doyle’s estate agree to dismiss lawsuit over Sherlock Holmes’ emotions",
            "description": "Netflix and Sir Arthur Conan Doyle’s estate have agreed to dismiss a lawsuit over the Netflix film Enola Holmes, which the estate argued depicted a still-copyrighted version of Sherlock Holmes played by Henry Cavill.",
            "content": "Netflix said the lawsuit would copyright warmth, kindness, empathy, or respect\r\nImage: Netflix\r\nSir Arthur Conan Doyles estate and the creators of Netflix movie Enola Holmes have agreed to dismiss a … [+1596 chars]"
        },
        {
            "title": "What's on TV this week: 'Wonder Woman 1984' and 'Akira' in 4K",
            "description": "This week is a light one due to the holiday, but for sports fans there’s plenty of college football, plus the beginning of the NBA season. HBO Max and Warner Bros. kick off a year of movie premieres that will be available at home with the release of Wonder Wo…",
            "content": "<li>London Hughes: To Catch a Dick, Netflix, 3 AM\r\n</li><li>A Teacher, Hulu, 3 AM\r\n</li><li>Lovestruck in the City (series premiere), Netflix, 3 AM\r\n</li><li>Moonshiners, Discovery, 8 PM\r\n</li><li>Th… [+2003 chars]"
        },
        {
            "title": "Now you can watch Netflix on your Echo Show",
            "description": "In September Amazon revealed its Echo Show 10 with a rotating base, and announced that Netflix streaming would come to the platform. Today is that day, and if you have one of Amazon’s Alexa-connected smart displays, you should be able to queue up a few episod…",
            "content": "In September Amazon revealed its Echo Show 10 with a rotating base, and announced that Netflix streaming would come to the platform. Today is that day, and if you have one of Amazon’s Alexa-connected… [+416 chars]"
        },
        {
            "title": "Netflix on the Wii U and 3DS will shut down on June 30th",
            "description": "The Netflix app on the Wii U and 3DS will be shut down for existing users on June 30th, 2021. If you’ve never downloaded it, it isn’t available anymore. But you can redownload Netflix if you’ve downloaded it in the past.",
            "content": "Theres still no Netflix app for the Switch\r\nNintendo is winding down support for the Netflix app on the Wii U and 3DS. The app will be shut down for existing users on June 30th, and if youve never do… [+1151 chars]"
        },
        {
            "title": "The best Netflix original shows and movies of 2020",
            "description": "Mashable's Brooke Bajgrowicz breaks down all the Netflix original movies and shows that made our queues brighter in 2020. (And don't @ us...these are in no particular order.) Read more...More about Mashable Video, Never Have I Ever, Netflix Original Film, Net…",
            "content": null
        },
        {
            "title": "What's on TV this week: NYE 2021, and 'Chilling Adventures of Sabrina'",
            "description": "As 2020 comes to a close we have the usual slew of wrap-ups and college football bowl games, but not many video games or movies to look forward to. Fans of Netflix’s Chilling Adventures of Sabrina will get the series finale later this week, followed by an Aft…",
            "content": "<li>A Teacher (season finale), Hulu, 3 AM\r\n</li><li>Lovestruck in the City, Netflix, 3 AM\r\n</li><li>Moonshiners, Discovery, 8 PM\r\n</li><li>Popstar's Best of 2020, CW, 8 PM\r\n</li><li>Alamo Bowl: Color… [+2485 chars]"
        },
        {
            "title": "Netflix won't work on Nintendo's Wii U and 3DS after June 30th",
            "description": "Netflix will stop streaming to Nintendo 3DS and Wii U devices later this year. In a support document spotted by Eurogamer, Nintendo says the company will discontinue support for the two consoles on June 30th, 2021 (coincidently, that’s the same day Minecraft …",
            "content": "Netflix will stop streaming to Nintendo 3DS and Wii U devices later this year. In a support document spotted by Eurogamer, Nintendo says the company will discontinue support for the two consoles on J… [+881 chars]"
        },
        {
            "title": "Where to Find Netflix's New Audio-Only Mode on Android",
            "description": "Netflix is currently testing out a special audio-only mode for its mobile apps—Android, specifically. While that’s no guarantee that the ever-so useful feature will see the light of day in a stable release, it’s promising, and if you’re lucky, you can test ou…",
            "content": "Netflix is currently testing out a special audio-only mode for its mobile appsAndroid, specifically. While thats no guarantee that the ever-so useful feature will see the light of day in a stable rel… [+2830 chars]"
        },
        {
            "title": "What's on TV this week: 'Tenet' and 'The Expanse'",
            "description": "This week Christopher Nolan’s Tenet makes its debut at home, via video on-demand at midnight ET, as well as on Ultra HD Blu-ray. On Amazon Prime, season five of The Expanse starts streaming, while CBS Access premieres its suddenly-relevant series The Stand, b…",
            "content": "Look below to check out each day's highlights, including trailers and let us know what you think (or what we missed).<li>Song Exploder (Vol. 2), Netflix, 3 AM\r\n</li><li>A Teacher, Hulu, 3 AM\r\n</li><l… [+3808 chars]"
        },
        {
            "title": "The 20 best documentaries on Netflix",
            "description": "Escapism is bliss, but knowledge is power.\nIt's why the humble documentary is more important than ever, unearthing truths, offering different perspectives, and introducing you to stories you might not have come across in your short time on this planet. \nNetfl…",
            "content": "Escapism is bliss, but knowledge is power.\r\nIt's why the humble documentary is more important than ever, unearthing truths, offering different perspectives, and introducing you to stories you might n… [+23469 chars]"
        },
        {
            "title": "‘Break It All’ Celebrates the Oppositional Energy of Latin Rock",
            "description": "A new six-part Netflix series explores half a century of music under pressure.",
            "content": "The documentary traces cycles of expansion, suppression and rebound, of growing ambitions and widening connections. Under dictatorships, rock was at times forced underground. In Argentina, after the … [+1372 chars]"
        },
        {
            "title": "The best dramas currently on Netflix",
            "description": "Want a movie you can really sink your teeth into? Look no farther than Netflix's drama library, in which a wealth of terrific titles in film and TV await you. Whether you're craving poignant period pieces, tender tearjerkers, unique crime narratives, acclaime…",
            "content": "Want a movie you can really sink your teeth into? Look no farther than Netflix's drama library, in which a wealth of terrific titles in film and TV await you. Whether you're craving poignant period p… [+8158 chars]"
        },
        {
            "title": "'Black Mirror' team's 'Death to 2020' special hits Netflix on December 27th",
            "description": "The team behind Black Mirror are back with their latest project, and instead of telling yet another story about how technology could ruin our lives, they have 2020 firmly in their crosshairs. The show’s creators, Charlie Brooker and Annabel Jones, have made a…",
            "content": "The team behind Black Mirror are back with their latest project, and instead of telling yet another story about how technology could ruin our lives, they have 2020 firmly in their crosshairs. The sho… [+534 chars]"
        },
        {
            "title": "Watch Out for Streaming Service Price Hikes in 2021",
            "description": "Price hikes for streaming TV has become a new holiday tradition, as Netflix, Disney+ and Hulu have increased their subscription prices ahead of 2021. For that reason, year-end is a good time to confirm how much you’re paying for subscriptions, and cancel thos…",
            "content": "Price hikes for streaming TV has become a new holiday tradition, as Netflix, Disney+ and Hulu have increased their subscription prices ahead of 2021. For that reason, year-end is a good time to confi… [+2731 chars]"
        },
        {
            "title": "See Martin Scorsese's new Netflix docuseries",
            "description": "\"Pretend It's a City\" is Martin Scorsese's upcoming docuseries focusing on New York City writer Fran Lebowitz. It is set to release on Netflix on January 8.",
            "content": null
        },
        {
            "title": "With ‘Bridgerton,’ Scandal Comes to Regency England",
            "description": "For her first Netflix series, Shonda Rhimes and her team infuse period-drama escapism with modern-day sensibilities.",
            "content": "To Rhimes, turning Ms. Bridgerton into some sort of renegade feminist would not have made sense in the context of the time; instead, the show allows for strategic moments of liberation in certain spe… [+1066 chars]"
        },
        {
            "title": "25th Amendment, Vaccines, Netflix: Your Tuesday Evening Briefing",
            "description": "Here’s what you need to know at the end of the day.",
            "content": "8. An ever-changing New York City.\r\nThe grand new Moynihan Train Hall at Pennsylvania Station, a $1.6 billion transformation of a former post office, has gifted the city with a lofty, light-filled st… [+450 chars]"
        },
        {
            "title": "'Outside the Wire' teaser shows Anthony Mackie as a cyborg solider",
            "description": "Netflix has been fairly quiet about Outside the Wire, a sci-fi thriller starring Anthony Mackie from the Marvel Cinematic Universe and Altered Carbon. But today we’re getting our first look at the action thanks to a just-released teaser trailer that shows Mac…",
            "content": "Netflix has been fairly quiet about Outside the Wire, a sci-fi thriller starring Anthony Mackie from the Marvel Cinematic Universe and Altered Carbon. But today we’re getting our first look at the ac… [+694 chars]"
        },
        {
            "title": "Netflix announces 'Shadow and Bone' premiere with creepy little teaser",
            "description": "The Shadow Fold is coming. Netflix revealed the release date for its upcoming Shadow and Bone on Thursday with a haunting teaser set in a snowy forest.\nShadow and Bone is based on the bestselling novels by Leigh Bardugo, in which the magical warrior Grisha (J…",
            "content": "The Shadow Fold is coming. Netflix revealed the release date for its upcoming Shadow and Bone on Thursday with a haunting teaser set in a snowy forest.\r\nShadow and Bone is based on the bestselling no… [+296 chars]"
        }
    ]
}