{
    "body": [
        {
            "title": "Elon Musk says he tried to sell Tesla to Apple and Tim Cook snubbed him",
            "description": "Elon Musk apparently once tried to sell Tesla to Apple. Replying to a tweet about yesterday’s Reuters report on the Apple’s electric car ambitions, Musk said, “During the darkest days of the Model 3 program, I reached out to Tim Cook to discuss the possibilit…",
            "content": "“Strange, if true,” Musk said of those suggestions. He went on to add Tesla already uses iron-phosphate batteries in vehicles it produces at its Shanghai Gigafactory, and said a monocell design is “e… [+597 chars]"
        },
        {
            "title": "Elon Musk says Tesla's Full Self-Driving subscription arrives in early 2021",
            "description": "Tesla is narrowing the time frame for the Full Self-Driving subscription rollout. Elon Musk told Twitter followers that the pay-per-month package is now due to arrive “early next year.” In theory, you could add the autonomous (currently semi-autonomous) featu…",
            "content": "Tesla is narrowing the time frame for the Full Self-Driving subscription rollout. Elon Musk told Twitter followers that the pay-per-month package is now due to arrive “early next year.” In theory, yo… [+299 chars]"
        },
        {
            "title": "Elon Musk has a new title: world’s richest person",
            "description": "Elon Musk, the controversial and enigmatic entrepreneur who heads up SpaceX and Tesla, has reached a status that only three others have held in the past two decades: world’s richest person. On his way to the top spot, Musk has surpassed a bevy of billionaires…",
            "content": "Elon Musk, the controversial and enigmatic entrepreneur who heads up SpaceX and Tesla, has reached a status that only three others have held in the past two decades: world’s richest person.\r\nOn his w… [+1890 chars]"
        },
        {
            "title": "Five easy ways for Elon Musk to combine his companies into a superconglomerate",
            "description": "Elon Musk says creating a holding company above Tesla, SpaceX, Neuralink, and The Boring Company is a “good idea.” It’s not that far-fetched an idea — after all, this is what Google did with Alphabet — so here are five ways he could do it.",
            "content": "Photo by Pauline Acalin for The Verge\r\n\n \n\n Elon Musk thinks it’s a “good idea” to create a holding company above Tesla, SpaceX, Neuralink, and The Boring Company — at least, that’s what the billiona… [+8054 chars]"
        },
        {
            "title": "Elon Musk surpasses Jeff Bezos to become the richest person in the world",
            "description": "After Tesla’s share price rose yet again on Thursday, Elon Musk has become the richest person in the world. He is now worth more than $185 billion. Amazon CEO Jeff Bezos had held the top spot since 2017, as CNBC notes, but his $184 billion fortune isn’t enoug…",
            "content": "After Tesla’s share price rose yet again on Thursday, Elon Musk has become the richest person in the world. He is now worth more than $185 billion. Amazon CEO Jeff Bezos had held the top spot since 2… [+422 chars]"
        },
        {
            "title": "Elon Musk dunks on Facebook and recommends Signal in wake of U.S. Capitol insurrection attempt",
            "description": "Elon Musk, the tech billionaire set to likely soon become the world’s richest man, and one of the most influential voices in the world of tech entrepreneurship, continued his recent trend of criticizing Facebook with a Twitter post late Wednesday night, follo…",
            "content": "Elon Musk, the tech billionaire set to likely soon become the world’s richest man, and one of the most influential voices in the world of tech entrepreneurship, continued his recent trend of criticiz… [+1327 chars]"
        },
        {
            "title": "How to Send Disappearing Messages in Signal",
            "description": "Many messaging apps let you send disappearing messages, but Signal’s approach to the process is one of the best. It’s another great reason to start using the encrypted chat app if you’re looking for privacy-focused messaging—or if you’re an Elon Musk fan.Read…",
            "content": "Many messaging apps let you send disappearing messages, but Signals approach to the process is one of the best. Its another great reason to start using the encrypted chat app if youre looking for pri… [+2313 chars]"
        },
        {
            "title": "Elon Musk Says He Wanted to Sell Tesla to Apple But Tim Cook Wouldn't Take the Meeting",
            "description": "Electric car maker Tesla is soaring high, with a $606.9 billion market cap and a stock price that’s up 813% this year. But Elon Musk really wanted to sell the company to Apple back in the days when Tesla was struggling. Tim Cook, the CEO of Apple since 2011, …",
            "content": "Electric car maker Tesla is soaring high, with a $606.9 billion market cap and a stock price thats up 813% this year. But Elon Musk really wanted to sell the company to Apple back in the days when Te… [+2841 chars]"
        },
        {
            "title": "Tesla delivers nearly 500,000 vehicles in 2020",
            "description": "Tesla delivered 499,550 vehicles in 2020, a 36% increase over the previous year and just a few dozen short of hitting an an historic and long-awaited milestone that CEO Elon Musk has been aiming for more than five years. Tesla reported Saturday that it produc…",
            "content": "Tesla delivered 499,550 vehicles in 2020, a 36% increase over the previous year and just a few dozen short of hitting an an historic and long-awaited milestone that CEO Elon Musk has been aiming for … [+1876 chars]"
        },
        {
            "title": "Tesla's latest update turns your EV into a boombox",
            "description": "Your Tesla could soon broadcast your taste in music to the world — if you have the right car, at least. Electrek notes that Tesla has released its promised holiday update, and the centerpiece appears to be a Boombox mode that pumps media outside as long as yo…",
            "content": "Your Tesla could soon broadcast your taste in music to the world — if you have the right car, at least. Electreknotes that Tesla has released its promised holiday update, and the centerpiece appears … [+704 chars]"
        },
        {
            "title": "Elon Musk says SpaceX to double launch pad usage for Starship tests, Super Heavy flights coming in a ‘few months’",
            "description": "SpaceX is set to significantly ramp up its Starship development program in the new year, in more ways than one. SpaceX CEO and founder Elon Musk noted on Twitter on Thursday that the company will seek to make use of both of its two launch pads at its developm…",
            "content": "SpaceX is set to significantly ramp up its Starship development program in the new year, in more ways than one. SpaceX CEO and founder Elon Musk noted on Twitter on Thursday that the company will see… [+1863 chars]"
        },
        {
            "title": "Full self-driving mode will open to all Tesla owners with monthly subscription",
            "description": "If you want your Tesla to drive itself down some streets and on the highway (with you still at the wheel, paying attention, of course) you need to put down some serious cash for the Full Self-Driving (FSD) mode. But in 2021, there might be more options. \nInst…",
            "content": "If you want your Tesla to drive itself down some streets and on the highway (with you still at the wheel, paying attention, of course) you need to put down some serious cash for the Full Self-Driving… [+1013 chars]"
        },
        {
            "title": "For Once, You Should Listen to Elon Musk",
            "description": "Elon Musk told us that Tesla would achieve “complete autonomy” in driverless cars by 2018, and we’re still waiting. He once tweeted that he’d secured funding to take Tesla private when he was ultimately just trying to make a weird weed reference. He told us t…",
            "content": "Elon Musk told us that Tesla would achieve complete autonomy in driverless cars by 2018, and were still waiting. He once tweeted that hed secured funding to take Tesla private when he was ultimately … [+2538 chars]"
        },
        {
            "title": "Tesla has decided to sell the cheaper Model Y standard range after all",
            "description": "Tesla has started taking orders for a cheaper standard range version of the Model Y in an apparent reversal by CEO Elon Musk who earlier this year seemed to put plans to release the vehicle on hold.  Electrek was the first to report that Tesla had updated its…",
            "content": "Tesla has started taking orders for a cheaper standard range version of the Model Y in an apparent reversal by CEO Elon Musk who earlier this year seemed to put plans to release the vehicle on hold. … [+967 chars]"
        },
        {
            "title": "Art imitates life as Tesla Cybertruck toy from Mattel misses ship date",
            "description": "Elon Musk can't be blamed for this production delay.",
            "content": "13 with 12 posters participating\r\nCustomers who were hoping to put a radio-controlled Hot Wheels Cybertruck under the Christmas tree will be disappointed this holiday season. Mattel has begun telling… [+1858 chars]"
        },
        {
            "title": "Tesla Reportedly Axes Model S and X Production for 18 Days, Says Workers Can ‘Volunteer’ to Deliver Vehicles",
            "description": "On the same day that Tesla CEO Elon Musk told his employees that they needed to increase production “as much as possible” for the remainder of the year, the company purportedly sent out an email informing its employees at its Fremont, California factory that …",
            "content": "On the same day that Tesla CEO Elon Musk told his employees that they needed to increase production as much as possible for the remainder of the year, the company purportedly sent out an email inform… [+4018 chars]"
        },
        {
            "title": "Elon Musk becomes world's richest person worth $185bn",
            "description": "The Tesla and SpaceX owner replaces Jeff Bezos as the richest man on the planet.",
            "content": "Elon Musk has become the world's richest person, as his net worth crossed $185bn (£136bn).\r\nThe Tesla and SpaceX entrepreneur was pushed into the top slot after Tesla's share price increased on Thurs… [+1633 chars]"
        },
        {
            "title": "Watch a young Elon Musk get his first supercar in 1999",
            "description": "Decades before becoming the world's richest person, a young Elon Musk showed off his newfound Silicon Valley riches when he received a brand new McLaren F1 supercar. From CNN's archives, watch it all unfold.",
            "content": ""
        },
        {
            "title": "Tesla's Elon Musk asks about converting 'large transactions' to bitcoin - Reuters India",
            "description": "Elon Musk on Sunday asked about the possibility of converting \"large transactions\" of Tesla Inc's balance sheet into bitcoin, according to a Twitter exchange between Musk and a well-known advocate for the digital currency.",
            "content": "(Reuters) - Elon Musk on Sunday asked about the possibility of converting large transactions of Tesla Incs balance sheet into bitcoin, according to a Twitter exchange between Musk and a well-known ad… [+1613 chars]"
        },
        {
            "title": "Tesla vehicles might be able to call 911 in the future - Roadshow",
            "description": "Elon Musk received the suggestion on Twitter and it sounds like he's all for it.",
            "content": "May as well put that network connection to good use.\r\nTesla\r\nTesla CEO Elon Musk loves a good tweet, and he regularly engages with owners of his company's electric cars on the social media platform. … [+1284 chars]"
        }
    ]
}