{
    "body": [
        {
            "title": "Tesla delivers nearly 500,000 vehicles in 2020",
            "description": "Tesla delivered 499,550 vehicles in 2020, a 36% increase over the previous year and just a few dozen short of hitting an an historic and long-awaited milestone that CEO Elon Musk has been aiming for more than five years. Tesla reported Saturday that it produc…",
            "content": "Tesla delivered 499,550 vehicles in 2020, a 36% increase over the previous year and just a few dozen short of hitting an an historic and long-awaited milestone that CEO Elon Musk has been aiming for … [+1876 chars]"
        },
        {
            "title": "Tesla launches the world's largest Supercharger station in Shanghai",
            "description": "Tesla has launched the world’s largest Supercharger station in China, the company announced on Wiebo. The 72-stall facility in Shanghai easily bests the 56 stall station the company opened last month in Fresno county, California, as Electrek noted. Unlike the…",
            "content": "Tesla has launched the world’s largest Supercharger station in China, the company announced on Wiebo. The 72-stall facility in Shanghai easily bests the 56 stall station the company opened last month… [+832 chars]"
        },
        {
            "title": "Apple, Amazon and Tesla supplier accused of using forced labor",
            "description": "According to an investigation by The Washington Post and the Tech Transparency Project, companies including Apple, Amazon and Tesla are sourcing parts from a Chinese supplier that allegedly uses forced Muslim labor. The Tech Transparency Project found documen…",
            "content": "An Apple spokesperson told the publication that the company confirmed Lens Technology “has not received any labor transfers of Uyghur workers from Xinjiang.” The company’s supplier progress report st… [+3132 chars]"
        },
        {
            "title": "Tesla's latest update turns your EV into a boombox",
            "description": "Your Tesla could soon broadcast your taste in music to the world — if you have the right car, at least. Electrek notes that Tesla has released its promised holiday update, and the centerpiece appears to be a Boombox mode that pumps media outside as long as yo…",
            "content": "Your Tesla could soon broadcast your taste in music to the world — if you have the right car, at least. Electreknotes that Tesla has released its promised holiday update, and the centerpiece appears … [+704 chars]"
        },
        {
            "title": "Elon Musk says Tesla's Full Self-Driving subscription arrives in early 2021",
            "description": "Tesla is narrowing the time frame for the Full Self-Driving subscription rollout. Elon Musk told Twitter followers that the pay-per-month package is now due to arrive “early next year.” In theory, you could add the autonomous (currently semi-autonomous) featu…",
            "content": "Tesla is narrowing the time frame for the Full Self-Driving subscription rollout. Elon Musk told Twitter followers that the pay-per-month package is now due to arrive “early next year.” In theory, yo… [+299 chars]"
        },
        {
            "title": "Full self-driving mode will open to all Tesla owners with monthly subscription",
            "description": "If you want your Tesla to drive itself down some streets and on the highway (with you still at the wheel, paying attention, of course) you need to put down some serious cash for the Full Self-Driving (FSD) mode. But in 2021, there might be more options. \nInst…",
            "content": "If you want your Tesla to drive itself down some streets and on the highway (with you still at the wheel, paying attention, of course) you need to put down some serious cash for the Full Self-Driving… [+1013 chars]"
        },
        {
            "title": "Five easy ways for Elon Musk to combine his companies into a superconglomerate",
            "description": "Elon Musk says creating a holding company above Tesla, SpaceX, Neuralink, and The Boring Company is a “good idea.” It’s not that far-fetched an idea — after all, this is what Google did with Alphabet — so here are five ways he could do it.",
            "content": "Photo by Pauline Acalin for The Verge\r\n\n \n\n Elon Musk thinks it’s a “good idea” to create a holding company above Tesla, SpaceX, Neuralink, and The Boring Company — at least, that’s what the billiona… [+8054 chars]"
        },
        {
            "title": "Tesla has decided to sell the cheaper Model Y standard range after all",
            "description": "Tesla has started taking orders for a cheaper standard range version of the Model Y in an apparent reversal by CEO Elon Musk who earlier this year seemed to put plans to release the vehicle on hold.  Electrek was the first to report that Tesla had updated its…",
            "content": "Tesla has started taking orders for a cheaper standard range version of the Model Y in an apparent reversal by CEO Elon Musk who earlier this year seemed to put plans to release the vehicle on hold. … [+967 chars]"
        },
        {
            "title": "Tesla to make India debut ‘early’ next year",
            "description": "Tesla will begin its operations in India “early” 2021, a top Indian minister said on Monday, a day after the tech carmaker said it was confident it would enter the world’s second most populated market next year. The American car company will begin operations …",
            "content": "Tesla will begin its operations in India early 2021, a top Indian minister said on Monday, a day after the tech carmaker said it was confident it would enter the worlds second most populated market n… [+3334 chars]"
        },
        {
            "title": "Tesla's refreshed Model S design may have been spotted on the road",
            "description": "Tesla’s Model S design hasn’t really changed much since 2016, but it appears poised for an (arguably overdue) update. According to Electrek, The Kilowatts have spotted what appears to be a Model S design refresh roaming around Palo Alto. At first glance, it’s…",
            "content": "Tesla’s Model S design hasn’t really changed much since 2016, but it appears poised for an (arguably overdue) update. According to Electrek, The Kilowatts have spotted what appears to be a Model S de… [+717 chars]"
        },
        {
            "title": "Elon Musk says he tried to sell Tesla to Apple and Tim Cook snubbed him",
            "description": "Elon Musk apparently once tried to sell Tesla to Apple. Replying to a tweet about yesterday’s Reuters report on the Apple’s electric car ambitions, Musk said, “During the darkest days of the Model 3 program, I reached out to Tim Cook to discuss the possibilit…",
            "content": "“Strange, if true,” Musk said of those suggestions. He went on to add Tesla already uses iron-phosphate batteries in vehicles it produces at its Shanghai Gigafactory, and said a monocell design is “e… [+597 chars]"
        },
        {
            "title": "NHTSA says users are to blame for reports of Teslas suddenly accelerating",
            "description": "Following a nearly year-long investigation, the National Highway Traffic Safety Administration (NHTSA) says Tesla vehicles don’t have a design flaw that makes them prone to sudden and unintended acceleration. The federal agency began looking into the issue la…",
            "content": "For Tesla, today’s decision will come as vindication. When the news of the petition first came out, the company said it was “completely false,” and went on to claim it was a ploy by a “short-seller” … [+832 chars]"
        },
        {
            "title": "Elon Musk Says He Wanted to Sell Tesla to Apple But Tim Cook Wouldn't Take the Meeting",
            "description": "Electric car maker Tesla is soaring high, with a $606.9 billion market cap and a stock price that’s up 813% this year. But Elon Musk really wanted to sell the company to Apple back in the days when Tesla was struggling. Tim Cook, the CEO of Apple since 2011, …",
            "content": "Electric car maker Tesla is soaring high, with a $606.9 billion market cap and a stock price thats up 813% this year. But Elon Musk really wanted to sell the company to Apple back in the days when Te… [+2841 chars]"
        },
        {
            "title": "China’s Baidu is building an EV with help from Polestar’s parent company",
            "description": "Baidu has already developed autonomous vehicle tech, but now plans to produce electric vehicles in partnership with Geely, the Chinese automaker that owns Volvo and Polestar, according to MSNBC. The idea is that Geely will design and manufacture the EVs, whil…",
            "content": "Baidu has already developed autonomous vehicle tech, but now plans to produce electric vehicles in partnership with Geely, the Chinese automaker that owns Volvo and Polestar, according to MSNBC. The … [+724 chars]"
        },
        {
            "title": "Tesla’s Model Y is the company’s latest five-star safety rated car",
            "description": "The Tesla Model Y is the electric car company’s latest vehicle to receive a five-star crash test safety rating from the NHTSA, joining the Model 3, Model S, and Model X.",
            "content": "Tesla’s vehicles have been acing the National Highway Traffic Safety Administration’s (NHTSA) crash tests for years, and the Model Y is now the latest to join those ranks, with the midsize SUV scorin… [+939 chars]"
        },
        {
            "title": "For Once, You Should Listen to Elon Musk",
            "description": "Elon Musk told us that Tesla would achieve “complete autonomy” in driverless cars by 2018, and we’re still waiting. He once tweeted that he’d secured funding to take Tesla private when he was ultimately just trying to make a weird weed reference. He told us t…",
            "content": "Elon Musk told us that Tesla would achieve complete autonomy in driverless cars by 2018, and were still waiting. He once tweeted that hed secured funding to take Tesla private when he was ultimately … [+2538 chars]"
        },
        {
            "title": "Redesigned Tesla Model S Reportedly Spotted in Palo Alto",
            "description": "What looks like a new version of the Tesla Model S was recently spotted cruising through Palo Alto, California, just a few weeks after the company hit pause on its vehicle production lines.Read more...",
            "content": "What looks like a new version of the Tesla Model S was recently spotted cruising through Palo Alto, California, just a few weeks after the company hit pause on its vehicle production lines.\r\nThe Kilo… [+3071 chars]"
        },
        {
            "title": "Tesla’s sudden accelerations were user error, US government says",
            "description": "The Department of Transportation’s National Highway Traffic Safety Administration has finished a year-long review of claims that Teslas were suddenly accelerating without warning, and it’s declining to open a full investigation. The safety agency says that, i…",
            "content": "The National Highway Traffic Safety Administration declined to open a full investigation\r\nPhoto by James Bareham / The Verge\r\nThe National Highway Traffic Safety Administration has ended a year-long … [+1317 chars]"
        },
        {
            "title": "NHTSA determines sudden acceleration complaints in Tesla vehicles were due to driver error",
            "description": "The U.S. Department of Transportation’s National Highway Traffic Safety Administration has determined the reports of sudden unintended acceleration (SUA) involving four different Tesla models were due to user error. The NHTSA first began investing the claims …",
            "content": "The U.S. Department of Transportations National Highway Traffic Safety Administration has determined the reports of sudden unintended acceleration (SUA) involving four different Tesla models were due… [+1710 chars]"
        },
        {
            "title": "Elon Musk has a new title: world’s richest person",
            "description": "Elon Musk, the controversial and enigmatic entrepreneur who heads up SpaceX and Tesla, has reached a status that only three others have held in the past two decades: world’s richest person. On his way to the top spot, Musk has surpassed a bevy of billionaires…",
            "content": "Elon Musk, the controversial and enigmatic entrepreneur who heads up SpaceX and Tesla, has reached a status that only three others have held in the past two decades: world’s richest person.\r\nOn his w… [+1890 chars]"
        }
    ]
}